[
  {
    "company_slug": "openai",
    "overview": "OpenAI is an AI research and deployment company dedicated to ensuring that general-purpose artificial intelligence benefits all of humanity. AI is an extremely powerful tool that must be created with safety and human needs at its core. OpenAI is dedicated to putting that alignment of interests first — ahead of profit.\n\nTo achieve our mission, we must encompass and value the many different perspectives, voices, and experiences that form the full spectrum of humanity. Our investment in diversity, equity, and inclusion is ongoing, executed through a wide range of initiatives, and championed and supported by leadership.\n\nAt OpenAI, we believe artificial intelligence has the potential to help people solve immense global challenges, and we want the upside of AI to be widely shared. Join us in shaping the future of technology.",
    "website": "https://openai.com/",
    "industry": "Research Services",
    "company_size": "201-500 employees",
    "headquarters": "San Francisco, CA",
    "job_openings_text": "OpenAI has 349 job openings - find the one for you."
  },
  {
    "company_slug": "amazon-web-services",
    "overview": "Launched in 2006, Amazon Web Services (AWS) began exposing key infrastructure services to businesses in the form of web services -- now widely known as cloud computing. The ultimate benefit of cloud computing, and AWS, is the ability to leverage a new business model and turn capital infrastructure expenses into variable costs. Businesses no longer need to plan and procure servers and other IT resources weeks or months in advance. Using AWS, businesses can take advantage of Amazon's expertise and economies of scale to access resources when their business needs them, delivering results faster and at a lower cost.\n\nToday, Amazon Web Services provides a highly reliable, scalable, low-cost infrastructure platform in the cloud that powers hundreds of thousands of businesses in 190 countries around the world. With data center locations in the U.S., Europe, Singapore, and Japan, customers across all industries are taking advantage of our low cost, elastic, open and flexible, secure platform.",
    "website": "http://aws.amazon.com",
    "industry": "IT Services and IT Consulting",
    "company_size": "10,001+ employees",
    "headquarters": "Seattle, WA",
    "job_openings_text": "Amazon Web Services (AWS) has 8,084 job openings - find the one for you."
  },
  {
    "company_slug": "github",
    "overview": "As the global home for all developers, GitHub is the complete AI-powered developer platform to build, scale, and deliver secure software. Over 100 million people, including developers from 90 of the Fortune 100 companies, use GitHub to build amazing things together across 330+ million repositories. With all the collaborative features of GitHub, it has never been easier for individuals and teams to write faster, better code.",
    "website": "https://github.com",
    "industry": "Software Development",
    "company_size": "501-1,000 employees",
    "headquarters": "San Francisco, CA",
    "job_openings_text": "GitHub has 80 job openings - find the one for you."
  },
  {
    "company_slug": "microsoft",
    "overview": "Every company has a mission. What's ours? To empower every person and every organization to achieve more. We believe technology can and should be a force for good and that meaningful innovation contributes to a brighter world in the future and today. Our culture doesn’t just encourage curiosity; it embraces it. Each day we make progress together by showing up as our authentic selves. We show up with a learn-it-all mentality. We show up cheering on others, knowing their success doesn't diminish our own. We show up every day open to learning our own biases, changing our behavior, and inviting in differences. Because impact matters. \n\nMicrosoft operates in 190 countries and is made up of approximately 228,000 passionate employees worldwide.",
    "website": "https://news.microsoft.com/",
    "industry": "Software Development",
    "company_size": "10,001+ employees",
    "headquarters": "Redmond, Washington",
    "job_openings_text": "Microsoft has 5,601 job openings - find the one for you."
  },
  {
    "company_slug": "perplexity-ai",
    "overview": "The most powerful answer engine. Powering curiosity with answers backed by up-to-date sources. This is where knowledge begins.",
    "website": "https://www.perplexity.ai",
    "industry": "Software Development",
    "company_size": "11-50 employees",
    "headquarters": "San Francisco, California",
    "job_openings_text": "Perplexity has 106 job openings - find the one for you."
  },
  {
    "company_slug": "boat-lifestyle",
    "overview": "boAt set its sail back in 2016. Both our founders, Aman Gupta and Sameer Mehta, realized the massive gaps in the audio and wearable market of India and hence founded boAt with the vision of making a lifestyle brand, that enhances the quality of life through audio and wearables.\n\nToday, boAt is the world's 2nd largest wearable brand (IDC Q3 2022) along with being India’s No.1 Audio brand. Seven years down the road, boAt has become a crucial part of cultural conversations for the younger generation, lifestyle influencers, audiophiles, and a lot of many segments. \nboAt has hence become an advocate of self-expression, adventurous experiences, and exploration all the way. Driven by a blazing passion for music and an instinct for innovation, boAt intends to deliver more than just a product to its community. This account is a sneak peek into the feisty world of boAt - its showrunners, hustle, collaborations, #InsideboAt culture and beyond.",
    "website": "http://www.boAt-lifestyle.com",
    "industry": "Computers and Electronics Manufacturing",
    "company_size": "501-1,000 employees",
    "headquarters": "Gurgaon, Haryana",
    "job_openings_text": "boAt Lifestyle has 2 job openings - find the one for you."
  },
  {
    "company_slug": "anthropicresearch",
    "overview": "We're an AI research company that builds reliable, interpretable, and steerable AI systems. Our first product is Claude, an AI assistant for tasks at any scale.\n\nOur research interests span multiple areas including natural language, human feedback, scaling laws, reinforcement learning, code generation, and interpretability.",
    "website": "https://www.anthropic.com/",
    "industry": "Research Services",
    "company_size": "501-1,000 employees",
    "job_openings_text": "Anthropic has 182 job openings - find the one for you."
  },
  {
    "company_slug": "genai-works",
    "overview": "Welcome to the heart of the global AI community, at https://genai.works!\n\nOver the past two years, we have grown to 12 million AI Enthusiasts across several platforms—becoming the world’s largest AI hub.\n\nWe provide an ecosystem for students, professionals, and industry leaders to engage in lively discussions, connect with peers, and explore career opportunities. Whether you're seeking AI solutions, information, networking opportunities, jobs, suitable apps, or the latest trends, we've got you covered:\nStay updated with the latest news, research, and breakthroughs in AI across various domains. \nEngage in lively discussions and connect with peers.\nExplore career opportunities.\n\nPromotion & Questions:\n\nJoin us as we push the boundaries of AI together. There's room for everyone to Discover, Learn and Grow. \n\nPlease use the \"Contact Us\" button for collaboration or other inquiries.\n\nUser Guidelines:\n\nSpamming, self-promotion, or selling products is not allowed. Please keep comments constructive, polite, and on-topic. \nViolations of these guidelines may result in removal or being blocked from the GenAI.Works community.",
    "website": "https://genai.works/",
    "industry": "Technology, Information and Internet",
    "company_size": "51-200 employees",
    "job_openings_text": "Generative AI has 2 job openings - find the one for you."
  },
  {
    "company_slug": "google",
    "overview": "A problem isn't truly solved until it's solved for all. Googlers build products that help create opportunities for everyone, whether down the street or across the globe. Bring your insight, imagination and a healthy disregard for the impossible. Bring everything that makes you unique. Together, we can build for everyone.\n\nCheck out our career opportunities at goo.gle/3DLEokh",
    "website": "https://goo.gle/3DLEokh",
    "industry": "Software Development",
    "company_size": "10,001+ employees",
    "headquarters": "Mountain View, CA",
    "job_openings_text": "Google has 3,922 job openings - find the one for you."
  },
  {
    "company_slug": "googledevelopers",
    "overview": "Discover the latest technologies, resources, events, and announcements to help you build smarter and ship faster.\n\nExplore more at developers.google.com",
    "website": "http://developers.google.com",
    "industry": "Technology, Information and Internet",
    "company_size": "10,001+ employees",
    "headquarters": "Mountain View, CA"
  },
  {
    "company_slug": "amazon",
    "overview": "Amazon is guided by four principles: customer obsession rather than competitor focus, passion for invention, commitment to operational excellence, and long-term thinking. We are driven by the excitement of building technologies, inventing products, and providing services that change lives. We embrace new ways of doing things, make decisions quickly, and are not afraid to fail. We have the scope and capabilities of a large company, and the spirit and heart of a small one.\n\nTogether, Amazonians research and develop new technologies from Amazon Web Services to Alexa on behalf of our customers: shoppers, sellers, content creators, and developers around the world.\n\nOur mission is to be Earth's most customer-centric company. Our actions, goals, projects, programs, and inventions begin and end with the customer top of mind.\n\nYou'll also hear us say that at Amazon, it's always \"Day 1.\" What do we mean? That our approach remains the same as it was on Amazon's very first day - to make smart, fast decisions, stay nimble, invent, and focus on delighting our customers.",
    "website": "https://www.aboutamazon.com/",
    "industry": "Software Development",
    "company_size": "10,001+ employees",
    "headquarters": "Seattle, WA",
    "job_openings_text": "Amazon has 25,955 job openings - find the one for you."
  },
  {
    "company_slug": "apple",
    "overview": "We’re a diverse collective of thinkers and doers, continually reimagining what’s possible to help us all do what we love in new ways. And the same innovation that goes into our products also applies to our practices — strengthening our commitment to leave the world better than we found it. This is where your work can make a difference in people’s lives. Including your own.\n\nApple is an equal opportunity employer that is committed to inclusion and diversity. Visit apple.com/careers to learn more.",
    "website": "http://www.apple.com/careers",
    "industry": "Computers and Electronics Manufacturing",
    "company_size": "10,001+ employees",
    "headquarters": "Cupertino, California"
  },
  {
    "company_slug": "google-summer-of-code-2019",
    "website": "https://summerofcode.withgoogle.com/",
    "industry": "Software Development",
    "company_size": "1,001-5,000 employees"
  },
  {
    "company_slug": "google-cloud",
    "overview": "Google Cloud accelerates every organization’s ability to digitally transform its business and industry. We deliver enterprise-grade solutions that leverage Google’s cutting-edge technology, and tools that help developers build more sustainably. Customers in more than 200 countries and territories turn to Google Cloud as their trusted partner to enable growth and solve their most critical business problems.",
    "website": "https://cloud.google.com/",
    "industry": "Software Development",
    "company_size": "10,001+ employees",
    "headquarters": "Mountain View, California"
  },
  {
    "company_slug": "ajiolife",
    "overview": "Progressive India’s fashion partner, AJIO is is the trendiest fashion destination for styles that are handpicked and at prices that are the best you’ll find anywhere. With over 1.3M+ styles and 5000+ brands, AJIO offers truly curated handpicked fashion for everyone. A fashion first marketplace with a wide variety of exclusive international brands, owned labels and homegrown brands, AJIO brings to you the best of convenience, variety and deals all around the year.",
    "website": "http://www.ajio.com",
    "industry": "Retail",
    "company_size": "501-1,000 employees",
    "headquarters": "Bengaluru, Karnataka"
  },
  {
    "company_slug": "nykaa-com",
    "overview": "At Nykaa, we share one vision- to bring inspiration and joy to people everywhere, every day. Born out of a desire to make beauty a mainstream choice, the Nykaa journey began in 2012 as a digitally native, consumer-tech company. Falguni Nayar’s entrepreneurial leap with Nykaa, tapped into an underserved beauty retail market, disrupting the ecosystem and putting India in the global spotlight. Over the years Nykaa has steadily captured hearts and carts, ushering visits to both our online and 150+ offline destinations and building loyal communities through engaging and educational content. We also expanded our offerings by introducing online platforms Nykaa Fashion, Nykaa Man, and Superstore.",
    "website": "http://www.nykaa.com",
    "industry": "Technology, Information and Internet",
    "company_size": "1,001-5,000 employees",
    "headquarters": "Mumbai, Maharashtra",
    "job_openings_text": "Nykaa has 15 job openings - find the one for you."
  },
  {
    "company_slug": "united-nations",
    "overview": "Founded at the end of the Second World War, the United Nations is an international organization made up of 193 Member States committed to maintaining international peace and security.\n\nEvery day the UN works to tackle global challenges and deliver results for those most in need.\n\nGiving life-saving support to populations hit by humanitarian crises, helping build and keep the peace in conflict-ridden areas, supporting governments and their citizens to advance development and fight poverty, and promoting human rights worldwide are the core pillars of the work of the United Nations and the mandates it receives from its Member States.\n\nThe Charter of the United Nations is available in full at: http://www.un.org/en/documents/charter/",
    "website": "http://www.un.org",
    "industry": "International Affairs",
    "company_size": "5,001-10,000 employees",
    "headquarters": "New York, NY",
    "job_openings_text": "United Nations has 2 job openings - find the one for you."
  },
  {
    "company_slug": "huggingface",
    "overview": "The AI community building the future.",
    "website": "https://huggingface.co",
    "industry": "Software Development",
    "company_size": "51-200 employees",
    "job_openings_text": "Hugging Face has 4 job openings - find the one for you."
  },
  {
    "company_slug": "mistralai",
    "overview": "Frontier AI. In your hands. \n\nWe believe in a future where AI is abundant and accessible. We aspire to empower the world to build with—and benefit from—the most significant technology of our time.\n\nJoin us: https://jobs.lever.co/mistral/",
    "website": "https://mistral.ai",
    "industry": "Technology, Information and Internet",
    "company_size": "201-500 employees",
    "headquarters": "Paris, France",
    "job_openings_text": "Mistral AI has 111 job openings - find the one for you."
  },
  {
    "company_slug": "meta",
    "overview": "Meta's mission is to build the future of human connection and the technology that makes it possible. \n\nOur technologies help people connect, find communities, and grow businesses. When Facebook launched in 2004, it changed the way people connect. Apps like Messenger, Instagram and WhatsApp further empowered billions around the world. Now, Meta is moving beyond 2D screens toward immersive experiences like augmented and virtual reality to help build the next evolution in social technology.\n\nTo help create a safe and respectful online space, we encourage constructive conversations on this page. Please note the following:\n\n• Start with an open mind. Whether you agree or disagree, engage with empathy.\n• Comments violating our Community Standards will be removed or hidden. Please treat everybody with respect.\n• Keep it constructive. Use your interactions here to learn about and grow your understanding of others.\n• Our moderators are here to uphold these guidelines for the benefit of everyone, every day.\n• If you are seeking support for issues related to your Facebook account, please reference our Help Center (https://www.facebook.com/help) or Help Community (https://www.facebook.com/help/community).\n\nFor a full listing of our jobs, visit https://www.metacareers.com",
    "website": "https://www.metacareers.com/",
    "industry": "Software Development",
    "company_size": "10,001+ employees",
    "headquarters": "Menlo Park, CA",
    "job_openings_text": "Meta has 2,670 job openings - find the one for you."
  },
  {
    "company_slug": "workfromhome-jobsforfreshers-experience",
    "overview": "",
    "website": "",
    "industry": "",
    "company_size": ""
  },
  {
    "company_slug": "careerupjobs",
    "overview": "Jobs in India has been providing jobs opportunities to aspirants. We started in Feb 2020 & at a time when layoffs and unemployment were at its peak.\nOur page follows a simple objective of bridging the gap between industry and fresher jobs/internship/work from home seekers and help them in these tough times.\n\nOur Page mainly deals in :\n1. Daily Jobs/Internships/ Fresher Jobs Vacancy \n2. College/ Organization Competitions for students\n3. Certifications\n4. Any Other Service that can help our followers\n\nWe have helped more than 70,000+ people secure jobs/internships in the last few months.\n\nIf you are an organization that wants to partner with us for any of the above services, do reach out to us at Talentjobshub@gmail.com",
    "website": "https://talentsjobs.in/",
    "industry": "Staffing and Recruiting",
    "company_size": "51-200 employees",
    "headquarters": "DELHI, NEW DELHI"
  },
  {
    "company_slug": "work-from-home-fresher-experience-world-wide-jobs",
    "industry": "",
    "company_size": ""
  },
  {
    "company_slug": "online-typing",
    "overview": "It is an typing educational institute. Our motto is to teach typing to all of our new generation. Anyone can visit our web portal and learn typing and several languages.",
    "website": "https://onlinetyping.org/",
    "industry": "E-Learning Providers",
    "company_size": "2-10 employees",
    "headquarters": "Mumbai, Maharashtra"
  },
  {
    "company_slug": "goldman-sachs",
    "followers": "5M followers",
    "overview": "We aspire to be the world’s most exceptional financial institution, united by our shared values of partnership, client service, integrity, and excellence. \n\nOperating at the center of capital markets, we act as one firm, mobilizing our people, capital, and ideas to deliver superior results across our clients’ most complex challenges.\n\nFor 156 years, Goldman Sachs has delivered world-class execution on a global scale across our leading Global Banking & Markets and Asset & Wealth Management businesses. \n\nApprenticeship is central to our culture, with hands-on coaching and access to leaders who bring decades of experience and expertise. With office locations around the world, we offer a broad range of career opportunities to those who insist on excellence and thrive on performance.\n\nFind our Social Media Disclosures here: gs.com/social-media-disclosures",
    "website": "http://www.goldmansachs.com",
    "industry": "Financial Services",
    "company_size": "10,001+ employees",
    "headquarters": "New York, New York",
    "job_openings_text": "Goldman Sachs has 1,431 job openings - find the one for you."
  },
  {
    "company_slug": "zomato",
    "followers": "2M followers",
    "overview": "Zomato’s mission statement is “better food for more people.” Since our inception in 2010, we have grown tremendously, both in scope and scale - and emerged as India’s most trusted brand during the pandemic, along with being one of the largest hyperlocal delivery networks in the country.\n\nToday, Zomato represents a wide range of cultures through its diversified 5000+ team members, 3.5 lakh+ delivery partners, and our biggest collective of the finest restaurant partners. We are grateful that our business is able to provide upward social and economic movement for millions of households – of our delivery partners, as well as restaurant staff. We think of all of us as one big family!\n\nOur passion is driven by purpose and we take immense pride in our initiative ‘Feeding India’, one of India’s largest not-for-profits working to ensure that nobody in India goes to bed hungry. As of now, Feeding India provides over 150,000 nutritious meals to the underprivileged every day.\n\nIn April 2020, Feeding India ran one of the largest food distribution drives in the world during the first wave of COVID, and distributed 78 million meals to daily wagers across the length and breadth of the country.\n\nDuring the second wave of COVID-19, Feeding India was again the first to act. We were able to source over 9,000 oxygen concentrators and distributed them for free to government hospitals across the country. This helped save millions of lives during one of the worst humanitarian crises faced by India in the recent times.\n\nWe’re innovating hard to make last-mile delivery carbon neutral, to eliminate the use of plastic packaging, create meaningful opportunities in the gig economy, and to feed our country’s ever-growing appetite for high-quality, affordable, and hygienic food, one delivery at a time!",
    "website": "https://www.zomato.com/",
    "industry": "Technology, Information and Internet",
    "company_size": "1,001-5,000 employees",
    "headquarters": "Gurugram, Haryana",
    "job_openings_text": "Zomato has 2 job openings - find the one for you."
  },
  {
    "company_slug": "jpmorganchase",
    "followers": "6M followers",
    "overview": "With a history tracing its roots to 1799 in New York City, JPMorganChase is one of the world's oldest, largest, and best-known financial institutions—carrying forth the innovative spirit of our heritage firms in global operations across 100 markets.\n \nWe serve millions of customers and many of the world’s most prominent corporate, institutional, and government clients daily, managing assets and investments, offering business advice and strategies, and providing innovative banking solutions and services.\n\nSocial Media Terms and Conditions: https://bit.ly/JPMCSocialTerms\n\n© 2024 JPMorgan Chase & Co. All rights reserved. JPMorganChase is an Equal Opportunity Employer, including Disability/Veterans.",
    "website": "http://www.jpmorganchase.com",
    "industry": "Financial Services",
    "company_size": "10,001+ employees",
    "headquarters": "New York, NY",
    "job_openings_text": "JPMorganChase has 5,959 job openings - find the one for you."
  },
  {
    "company_slug": "bigbasket-com",
    "followers": "382K followers",
    "overview": "Starting our journey in 2011, today, bigbasket - a Tata Enterprise is India’s largest online supermarket with over 13 million customers and a presence in 60+ cities & towns. With our presence spanning the entire spectrum of consumer needs, we operate through a range of business lines - bigbasket, bbnow, bbinstant, bbdaily, fresho, bbmandi, and bbsaathi. We offer convenience by making grocery shopping easy for customers while enhancing their experience. With more than 47,000 employees, we are a proud & growing bigbasket family. With our businesses scaling, we are keen on working with the best talent in the industry.\n\nEvery bigbasketeer embodies the ‘Spirit of bb’ that defines our work ethos. We believe in nurturing a people-first environment where the health and well-being of our employees are always prioritised. Fostering bigbasket’s value system, we encourage humility, transparency, integrity, and respect amongst each other to create an elevated work culture. At bigbasket, we empower every bigbasketeer with responsibility and ownership in everything they do. Being a customer-centric organisation, we operate with a maniacal focus on customers ensuring we always deliver our best.\n\nbigbasket has been proudly certified as a Great Place to Work, and Great Place to Work for Women. Our business model is designed to create opportunities for our country’s gig economy. We have achieved the highest ranking in the Fairwork India Ratings for Gig Workers. Through our DEI initiative – Aarambh, we foster Diversity, Equity, & Inclusion driving a workplace where everybody feels welcomed.\n\nAlongside this, we take conscious and proactive measures towards curtailing our impact on the environment. Our electric vehicles delivery fleet and solar panel equipped warehouses help us minimize carbon emissions. By promoting organic farming, we encourage fresh farm produce contributing to good land and soil health.\n\n#JoinTheSquad and be a part of our growth story!",
    "website": "http://www.bigbasket.com",
    "industry": "Software Development",
    "company_size": "10,001+ employees",
    "headquarters": "Bangalore, Karnataka",
    "job_openings_text": "bigbasket has 3 job openings - find the one for you."
  },
  {
    "company_slug": "youtube",
    "followers": "2M followers",
    "overview": "YouTube is a team-oriented, creative workplace where every single employee has a voice in the choices we make and the features we implement. We work together in small teams to design, develop, and roll out key features and products in very short time frames. Which means something you write today could be seen by millions of viewers tomorrow. And even though we’re a part of Google and enjoy all of the corporate perks, it still feels like you’re working at a startup.\n\nYouTube is headquartered in San Bruno, California, 12 miles south of San Francisco. We also have many job openings in Mountain View, and across the globe",
    "website": "http://www.youtube.com/jobs",
    "industry": "Technology, Information and Internet",
    "company_size": "1,001-5,000 employees",
    "headquarters": "San Bruno, CA"
  },
  {
    "company_slug": "tiktok",
    "followers": "4M followers",
    "overview": "TikTok is the world's leading destination for short-form video. Our platform is built to help imaginations thrive. This is doubly true of the teams that make TikTok possible. \n \nOur employees lead with curiosity, and move at the speed of culture. Combined with our company's flat structure, you'll be given dynamic opportunities to make a real impact on a rapidly expanding company as you grow your career. We have offices across Asia Pacific, the Middle East, Europe, and the Americas – and we're just getting started.",
    "website": "https://www.tiktok.com/about?lang=en",
    "industry": "Entertainment Providers",
    "company_size": "10,001+ employees",
    "headquarters": "Los Angeles, California",
    "job_openings_text": "TikTok has 2,883 job openings - find the one for you."
  },
  {
    "company_slug": "ibm",
    "followers": "19M followers",
    "overview": "At IBM, we do more than work. We create. We create as technologists, developers, and engineers. We create with our partners. We create with our competitors. If you're searching for ways to make the world work better through technology and infrastructure, software and consulting, then we want to work with you.\n\nWe're here to help every creator turn their \"what if\" into what is. Let's create something that will change everything.",
    "website": "http://www.ibm.com",
    "industry": "IT Services and IT Consulting",
    "company_size": "10,001+ employees",
    "headquarters": "Armonk, New York, NY",
    "job_openings_text": "IBM has 5,465 job openings - find the one for you."
  },
  {
    "company_slug": "myntra",
    "followers": "2M followers",
    "overview": "At Myntra, we don’t just follow fashion - we define it.\n\nAs India's leading fashion, lifestyle, and beauty destination, we bring together the best of style, technology, and innovation to create a seamless shopping experience for our customers. With a commitment to empowering self-expression, we curate over 13,000+ brands and labels, blending global trends with India’s unique fashion pulse.\n\nOur people are at the heart of everything we do. We thrive on innovation and impact, where data-driven insights and cutting-edge technology shape the future of fashion. We encourage out-of-the-box thinking, collaboration with leaders and experts, and driving meaningful change.\n\nMyntraites have a passion for fashion - we take pride in being India's voice in fashion and in the brand we stand for. Our non-hierarchical, inclusive culture values ownership, meritocracy, and self-driven individuals who challenge the status quo and grow with every opportunity.\n\nWe believe in empowering every Myntraite by providing the freedom to shape their career, fostering an environment where creativity thrives, and ensuring well-being and self-expression for all.\n\nIf you thrive in a fast-paced, result-driven environment and share our passion for fashion, Myntra is the place for you.\n\nExplore opportunities: https://jobs.myntra.com/home\n\nBe The Trend. Be Myntra.",
    "website": "https://life.myntra.com/",
    "industry": "Technology, Information and Internet",
    "company_size": "1,001-5,000 employees",
    "headquarters": "Bengaluru, Karnataka",
    "job_openings_text": "Myntra has 4 job openings - find the one for you."
  },
  {
    "company_slug": "linkedin",
    "followers": "32M followers",
    "overview": "Founded in 2003, LinkedIn connects the world's professionals to make them more productive and successful. With more than 1 billion members worldwide, including executives from every Fortune 500 company, LinkedIn is the world's largest professional network. The company has a diversified business model with revenue coming from Talent Solutions, Marketing Solutions, Sales Solutions and Premium Subscriptions products. Headquartered in Silicon Valley, LinkedIn has offices across the globe..",
    "website": "https://careers.linkedin.com",
    "industry": "Software Development",
    "company_size": "10,001+ employees",
    "headquarters": "Sunnyvale, CA",
    "job_openings_text": "LinkedIn has 306 job openings - find the one for you."
  },
  {
    "company_slug": "paytm",
    "followers": "2M followers",
    "overview": "India's leading mobile payments and financial services distribution company. Pioneers of mobile payments in the country, having built QR for payments, Soundbox, and innovative card machines that empower businesses. Committed to delivering a simple, clean, and trusted payments experience. Now advancing UPI with thoughtful product innovations like Hide Payments, UPI statement download, total balance check across linked accounts, QR widget, Autopay for recurring payments, self account transfers, and more. \n\nLink your bank account on the Paytm app and get your new UPI ID today 🚀",
    "website": "https://www.paytm.com",
    "industry": "Financial Services",
    "company_size": "10,001+ employees",
    "headquarters": "Noida, Uttar Pradesh",
    "job_openings_text": "Paytm has 4 job openings - find the one for you."
  },
  {
    "company_slug": "rapido-bike",
    "followers": "470K followers",
    "overview": "We’re India’s largest Bike Taxi App service and making quick strides in app-based auto rickshaws and delivery, among others. We’re on a mission to revolutionize the way people commute. And while we’re at it, we aim at creating a workplace that is fun, inclusive and perfectly fits all!",
    "website": "https://rapido.bike/",
    "industry": "Technology, Information and Internet",
    "company_size": "1,001-5,000 employees",
    "headquarters": "Bangalore, Karnataka",
    "job_openings_text": "Rapido has 5 job openings - find the one for you."
  },
  {
    "company_slug": "zeptonow",
    "followers": "798K followers",
    "overview": "Founded in 2021 by Aadit Palicha and Kaivalya Vohra, Zepto is on a mission to save you time —making every second count towards life's real joys. Our platform has revolutionised rapid commerce in India with cutting-edge technology and strategically optimised delivery hubs. Zepto offers an extensive range of 45,000+ products, from fresh groceries to electronics, beauty essentials, apparels, toys and more, delivering across 50+ cities in 10 minutes*.\n\nZepto Café extends our commitment to convenience, featuring a curated menu of over 200 fresh items.",
    "website": "http://zeptonow.com",
    "industry": "Technology, Information and Internet",
    "company_size": "5,001-10,000 employees",
    "job_openings_text": "Zepto has 13 job openings - find the one for you."
  },
  {
    "company_slug": "swiggy-in",
    "followers": "2M followers",
    "overview": "Swiggy is India’s pioneering on-demand convenience platform, catering to millions of consumers each month. Founded in 2014, its mission is to elevate the quality of life for the urban consumer by offering unparalleled convenience. With an extensive footprint in food delivery, Swiggy Food collaborates with nearly 2 lakh restaurants across 600+ cities. Swiggy Instamart, its quick commerce platform operating in 120+ cities, delivers groceries and other essentials across 40+ categories in 10 minutes. Fueled by a commitment to innovation, Swiggy continually incubates and integrates new services like Swiggy Dineout and Swiggy Genie into its multi-service app. Leveraging cutting-edge technology and Swiggy One, the country’s only membership program offering benefits across food, quick commerce, dining out, and pick-up and drop services, Swiggy aims to provide a superior experience to its consumers. \n\nFor more information, visit www.swiggy.com",
    "website": "https://careers.swiggy.com",
    "industry": "Technology, Information and Internet",
    "company_size": "10,001+ employees",
    "headquarters": "Bengaluru, Karnataka",
    "job_openings_text": "Swiggy has 218 job openings - find the one for you."
  },
  {
    "company_slug": "wipro",
    "followers": "11M followers",
    "overview": "Wipro Limited (NYSE: WIT, BSE: 507685, NSE: WIPRO) is a leading technology services and consulting company focused on building innovative solutions that address clients’ most complex digital transformation needs. Leveraging our holistic portfolio of capabilities in consulting, design, engineering, and operations, we help clients realize their boldest ambitions and build future-ready, sustainable businesses. With over 230,000 employees and business partners across 65 countries, we deliver on the promise of helping our clients, colleagues, and communities thrive in an ever-changing world. For additional information, visit us at www.wipro.com",
    "website": "http://www.wipro.com",
    "industry": "IT Services and IT Consulting",
    "company_size": "10,001+ employees",
    "headquarters": "Bangalore, Karnataka",
    "job_openings_text": "Wipro has 2,176 job openings - find the one for you."
  },
  {
    "company_slug": "meesho",
    "followers": "1M followers",
    "overview": "Meesho is India’s e-commerce marketplace, on a mission to democratise internet commerce. Our multi-sided technology platform connects four key stakeholders — consumers, sellers, logistics partners, and content creators — to power inclusive growth at scale. \n\nWe enable individuals and small businesses to sell online with ease, offering access to a wide customer base, integrated logistics, payment solutions, and platform support. For customers, Meesho offers a broad and affordable selection, tailored for diverse needs across Bharat. We also empower creators to build commerce-driven content that drives discovery and engagement.\nOur logistics operations are powered by Valmo, Meesho’s asset-light logistics platform that works entirely through partner-led infrastructure to ensure cost-efficient and scalable deliveries.",
    "website": "https://meesho.io/",
    "industry": "Technology, Information and Internet",
    "company_size": "1,001-5,000 employees",
    "headquarters": "Bangalore, Karnataka",
    "job_openings_text": "Meesho has 78 job openings - find the one for you."
  },
  {
    "company_slug": "cognizant",
    "followers": "8M followers",
    "overview": "Cognizant (Nasdaq-100: CTSH) engineers modern businesses. We help our clients modernize technology, reimagine processes and transform experiences so they can stay ahead in our fast-changing world. Together, we’re improving everyday life. See how at www.cognizant.com or @cognizant.",
    "website": "https://www.cognizant.com",
    "industry": "IT Services and IT Consulting",
    "company_size": "10,001+ employees",
    "headquarters": "Teaneck, New Jersey",
    "job_openings_text": "Cognizant has 1,889 job openings - find the one for you."
  },
  {
    "company_slug": "tech-mahindra",
    "followers": "7M followers",
    "overview": "Tech Mahindra offers technology consulting and digital solutions to global enterprises across industries, enabling transformative scale at unparalleled speed. With 150,000+ professionals across 90+ countries helping 1100+ clients, TechM provides a full spectrum of services including consulting, information technology, enterprise applications, business process services, engineering services, network services, customer experience & design services, AI & analytics, and cloud & infrastructure services. It is the first Indian company in the world to have been awarded the Sustainable Markets Initiative’s Terra Carta Seal, in recognition of actively leading the charge to create a climate and nature-positive future.\n\nTech Mahindra (NSE: TECHM) is part of the Mahindra Group, founded in 1945, one of the largest and most admired multinational federations of companies.\n\nVisit www.techmahindra.com to #ScaleAtSpeed",
    "website": "www.techmahindra.com",
    "industry": "IT Services and IT Consulting",
    "company_size": "10,001+ employees",
    "headquarters": "Pune, Maharashtra",
    "job_openings_text": "Tech Mahindra has 538 job openings - find the one for you."
  },
  {
    "company_slug": "tata-consultancy-services",
    "followers": "18M followers",
    "overview": "Tata Consultancy Services (TCS) is an IT services, consulting, and business solutions organization that has been partnering with many of the world’s largest businesses in their transformation journeys since its inception in 1968. Our consulting led, innovation-driven services help businesses evolve as perpetually adaptive enterprises, staying ahead in an ever-changing digital landscape. Recognized for excellence in software development, we rapidly apply and scale new technologies, driving long-term value and scalable transformation. Many of these relationships have endured for decades, navigating every technology cycle from mainframes in the 1970s to Artificial Intelligence today.\n \nA part of the Tata Group, India’s largest multinational business group, TCS has a highly skilled workforce of over 613,069 consultants in 55 countries and 202 service delivery centers across the world.\n \nCaution against fraudulent job offers: TCS doesn’t charge any fee throughout the recruitment process. Refer here: https://www.tcs.com/careers/india/recruitment-fraud-alert",
    "website": "https://www.tcs.com/",
    "industry": "IT Services and IT Consulting",
    "company_size": "10,001+ employees",
    "headquarters": "Mumbai, Maharashtra",
    "job_openings_text": "Tata Consultancy Services has 2,812 job openings - find the one for you."
  },
  {
    "company_slug": "american-express",
    "followers": "3M followers",
    "overview": "At American Express, we know that with the right backing, people and businesses have the power to progress in incredible ways. Whether we’re supporting our customers’ financial confidence to move ahead, taking commerce to new heights, or encouraging people to explore the world, our colleagues are constantly striving to uphold our powerful backing promise to our customers and each other every day. \n \nThese beliefs have been our North Star for 170 years as our business transformed – from helping evacuate travelers during World Wars, to ensuring the safety of our customers’ funds during the Great Depression in the U.S., to creating the Shop Small® movement to help small businesses recover from the Financial Crisis, to providing aid to communities impacted by many natural disasters and so much more.  \n \nFor generations, the key to our success has been the determination and resilience of our American Express colleagues. Now, as a globally integrated payments company, we work together to provide customers with access to products, insights and world-class experiences that enrich lives and build business success. Join us and let’s lead the way together. \n\nLearn more about us at: \nhttps://www.americanexpress.com/careers\nhttps://www.americanexpress.com/\nhttps://www.facebook.com/AmericanExpressUS\nhttps://www.instagram.com/americanexpress/\nhttps://twitter.com/americanexpress\nhttps://www.youtube.com/user/AmericanExpress\n\nSee our community guidelines at: \nhttps://www.americanexpress.com/en-us/company/community-guidelines/\n\nIf you have a customer service issue or question, please visit www.americanexpress.com/contactus",
    "website": "https://www.americanexpress.com/",
    "industry": "Financial Services",
    "company_size": "10,001+ employees",
    "headquarters": "New York, NY",
    "job_openings_text": "American Express has 548 job openings - find the one for you."
  },
  {
    "company_slug": "lenskart-com",
    "followers": "486K followers",
    "overview": "At Lenskart, we believe that clear vision is fundamental to the personal development and well-being of an individual, and our aim is to build tech-enabled solutions that improve access to affordable and quality ‘Eyewear for All’. We commenced our operations in India as an online business in 2010 and opened our first retail store in New Delhi in 2013. Since then, we have scaled through both the online and offline channels and have established a presence through our retail stores, websites, mobile applications, and other channels.",
    "website": "http://www.lenskart.com",
    "industry": "Technology, Information and Internet",
    "company_size": "10,001+ employees",
    "job_openings_text": "Lenskart.com has 272 job openings - find the one for you."
  },
  {
    "company_slug": "sqli",
    "followers": "178K followers",
    "overview": "As leading European customer experience and digital transformation services group, SQLI empowers international brands to generate value through digital innovation. \n\nWe craft engaging experiences by combining cutting-edge technology, proven methodologies, and deep technological expertise. At every stage, AI is embedded as a core driver of value—enhancing insights, automation, personalization, and scalability. From strategy to deployment, we design and build robust, high-performing architectures that enhance agility, boost efficiency, and drive sustainable business growth.  What sets us apart?  A unique mix of cross-disciplinary talent, global delivery strength, and an obsession with client outcomes.\n \nWe Elevate. Digitally.",
    "website": "http://www.sqli.com",
    "industry": "IT Services and IT Consulting",
    "company_size": "1,001-5,000 employees",
    "headquarters": "Levallois-Perret, Île-de-France",
    "job_openings_text": "SQLI has 93 job openings - find the one for you."
  },
  {
    "company_slug": "canva",
    "followers": "2M followers",
    "overview": "We're a global online visual communications platform on a mission to empower the world to design. Featuring a simple drag-and-drop user interface and a vast range of templates ranging from presentations, documents, websites, social media graphics, posters, apparel to videos, plus a huge library of fonts, stock photography, illustrations, video footage, and audio clips, anyone can take an idea and create something beautiful on Canva on any device, from anywhere in the world.\n\nSince our launch in 2013, we’ve had the crazy big goal of making design accessible to everyone. We were founded on the belief that people shouldn't need to understand complex software to unlock their creativity. We’re leveling the playing field and democratizing access to design and visual communication by empowering 100% of the world to communicate in a way that was once limited to the 1%. \n\nWe've always had a deeper mission surrounding Canva — which we talk about as our 'simple' two-step plan: to build one of the world’s most valuable companies, and to do the most good we possibly can. We're committed to our core value of Being a Force for Good, so as the value of our company grows, so too does our ability to have a positive impact on the world.",
    "website": "http://www.canva.com",
    "industry": "Software Development",
    "company_size": "1,001-5,000 employees",
    "headquarters": "Surry Hills, New South Wales",
    "job_openings_text": "Canva has 320 job openings - find the one for you."
  },
  {
    "company_slug": "netflix",
    "followers": "11M followers",
    "overview": "Netflix is one of the world's leading entertainment services, with over 300 million paid memberships in over 190 countries enjoying TV series, films and games across a wide variety of genres and languages. Members can play, pause and resume watching as much as they want, anytime, anywhere, and can change their plans at any time.",
    "website": "https://jobs.netflix.com?utm_campaign=LIHomePage&utm_source=linkedin",
    "industry": "Entertainment Providers",
    "company_size": "10,001+ employees",
    "headquarters": "Los Gatos, CA",
    "job_openings_text": "Netflix has 563 job openings - find the one for you."
  },
  {
    "company_slug": "the-walt-disney-company",
    "followers": "6M followers",
    "overview": "The Walt Disney Company, together with its subsidiaries and affiliates, is a leading diversified international family entertainment and media enterprise that includes three core business segments: Disney Entertainment, ESPN, and Disney Experiences.\n\nOur mission is to entertain, inform and inspire people around the globe through the power of unparalleled storytelling, reflecting the iconic brands, creative minds and innovative technologies that make us the world’s premier entertainment company.",
    "website": "http://www.disneycareers.com",
    "industry": "Entertainment Providers",
    "company_size": "10,001+ employees",
    "headquarters": "Burbank, CA",
    "job_openings_text": "The Walt Disney Company has 908 job openings - find the one for you."
  },
  {
    "company_slug": "infosys",
    "followers": "10M followers",
    "overview": "Infosys is a global leader in next-generation digital services and consulting. We enable clients in more than 50 countries to navigate their digital transformation. With over three decades of experience in managing the systems and workings of global enterprises, we expertly steer our clients through their digital journey. We do it by enabling the enterprise with an AI-powered core that helps prioritize the execution of change. We also empower the business with agile digital at scale to deliver unprecedented levels of performance and customer delight. Our always-on learning agenda drives their continuous improvement through building and transferring digital skills, expertise, and ideas from our innovation ecosystem.\n\nVisit www.infosys.com to see how Infosys (NYSE: INFY) can help your enterprise navigate your next.",
    "website": "https://www.infosys.com",
    "industry": "IT Services and IT Consulting",
    "company_size": "10,001+ employees",
    "headquarters": "Bangalore, Karnataka",
    "job_openings_text": "Infosys has 3,041 job openings - find the one for you."
  },
  {
    "company_slug": "spotify",
    "followers": "4M followers",
    "overview": "Our mission is to unlock the potential of human creativity—by giving a million creative artists the opportunity to live off their art and billions of fans the opportunity to enjoy and be inspired by it.\n \nSpotify transformed music listening forever when it launched in Sweden in 2008. Discover, manage and share over 70m tracks for free, or upgrade to Spotify Premium to access exclusive features including offline mode, improved sound quality, and an ad-free music listening experience. \n\nToday, Spotify is the most popular global audio streaming service with 365m users, including 165m subscribers across 178 markets. We are the largest driver of revenue to the music business today.",
    "website": "http://www.lifeatspotify.com",
    "industry": "Musicians",
    "company_size": "5,001-10,000 employees",
    "headquarters": "Stockholm, Stockholm County",
    "job_openings_text": "Spotify has 114 job openings - find the one for you."
  },
  {
    "company_slug": "pepsico",
    "followers": "9M followers",
    "overview": "PepsiCo is a playground for curious people. We invite thinkers, doers, and changemakers to champion innovation, take calculated risks, and challenge the status quo. From executives to team members on the front lines, we’re excited about the future. We take chances. Together, we dare to make the world a better place.\n \nOur associates are the magic ingredient. Each of them plays an integral role in helping create deep connections between people and our products. Think about your last group celebration: Chances are, one of our iconic brands was by your side. At PepsiCo, you’re invited to be a part of a global team of innovators who make, move, and sell these products—which are enjoyed by more than 1 billion people a day.\n \nA career at PepsiCo means working in a culture where everyone’s welcome. Here, you can dare to be yourself. No matter who you are or where you’re from, you can influence the people around you and the world at large. By showing up, you’ll have the opportunity to learn, develop and grow your skills for the future. Our supportive teams can fuel your professional goals to make a global impact on people and the planet. \n\nJoin us. Dare for Better.",
    "website": "http://www.pepsico.com",
    "industry": "Food and Beverage Services",
    "company_size": "10,001+ employees",
    "headquarters": "Purchase, New York",
    "job_openings_text": "PepsiCo has 2,734 job openings - find the one for you."
  },
  {
    "company_slug": "reliance-retail",
    "followers": "1M followers",
    "overview": "Reliance Retail is the retail initiative of RIL and an epicentre of our consumer-facing businesses. It has been ranked as the fastest-growing retailer in the world. It is ranked 53rd in the list of Top Global Retailers and is the only Indian Retailer to feature in the Top 100. It is the largest & the most profitable retailer in India with the widest reach. It has nearly 249 million registered customers buying across all its formats. It recorded more than 780 million footfalls across all its stores in FY23, a scale unmatched by any other retailer in India. With over 3 Million daily transactions, Reliance Retail operates at a scale unparalleled in the Indian retail industry and continues to enrich the quality of lives of millions of Indians every day.\nCorporate frauds have become rampant, we wish to caution all potential job seekers that Reliance Industries Ltd. & its Group Companies: \n1. Do not charge any job seeker any money or deposit for giving employment offers and interviews or for providing laptop/uniform. \n2. Do not appoint any Agents, Agencies, or Individuals to make or issue offers of employment or benefits on their behalf. \n3. Do not ask for personal documents like mark sheets, PAN Card, Aadhaar Card, CV to be shared through WhatsApp or any other social media platform\n4. Do not communicate using personal email IDs like Gmail, Yahoo, Hotmail, Outlook, etc. All official communications related to employment are done using an email address ending with “@ril.com”. \n5. Reliance Industries Ltd. and its Group Companies will neither be responsible for losses arising out of any fraudulent transactions nor bound by any fraudulent offers. \n6. As a responsible employer we have also developed a “Validate Your Offer” tab on our career page which can validate authenticity of offer released to candidates. It will be in our mutual interest that should there be any suspicious activity pertaining to fraudulent enrolment noticed, report to rr.vigilance@ril.com.",
    "website": "http://www.relianceretail.com",
    "industry": "Retail",
    "company_size": "10,001+ employees",
    "headquarters": "Mumbai, Maharashtra",
    "job_openings_text": "Reliance Retail has 164 job openings - find the one for you."
  },
  {
    "company_slug": "nestle-s-a-",
    "followers": "17M followers",
    "overview": "As the world’s largest food and beverage company we are driven by a simple aim: unlocking the power of food to enhance quality of life for everyone, today and for generations to come. To deliver on this, we serve with passion, with a spirit of excellence, offering products and services for all stages of life, every moment of the day, helping people care for themselves and their families. Our culture is based on our values rooted in respect: respect for ourselves, respect for others, respect for diversity and respect for the future.\n\nWe can trace our origin back to 1866, when the first European condensed milk factory was opened in Cham, Switzerland, by the Anglo-Swiss Condensed Milk Company. One year later, Henri Nestlé, a trained pharmacist, launched one of the world’s first prepared infant cereals ‘Farine lactée’ in Vevey, Switzerland.\n\nToday, we employ around 273,000 people and have factories or operations in almost every country in the world. With our headquarters still based in the Swiss town of Vevey, we had sales of CHF 84.3 billion in 2020.\n\nOur portfolio covers almost every food and beverage category – offering products and services for all stages of life, every moment of the day, helping people care for themselves and their families.\n\nHouse rules: https://nes.tl/HouseRules",
    "website": "http://www.nestle.com",
    "industry": "Food and Beverage Services",
    "company_size": "10,001+ employees",
    "job_openings_text": "Nestlé has 1,951 job openings - find the one for you."
  },
  {
    "company_slug": "lor%C3%A9al",
    "followers": "6M followers",
    "overview": "No.1 Beauty Group Worldwide.\nNo.1 most innovative company in Europe (Fortune's ranking).\n\nWe are 90K employees across 150 countries on five continents, united by our shared purpose: creating the beauty that moves the world.  \n\nOur 37 international brands are divided into four unique Divisions: Luxe, Consumer Products, Dermatological Beauty, and Professional Products. This diverse portfolio includes brands like Kiehl’s, Lancôme, Giorgio Armani Beauty, Yves Saint Laurent Beauté, Ralph Lauren, Aesop, Maybelline New York, Essie, Kérastase, IT Cosmetics, Prada Beauty, Biotherm, Shu Uemura, Viktor&Rolf, Maison Margiela, Urban Decay, Redken, Vichy, La Roche-Posay, Diesel, Garnier, L’Oréal Paris, and more. \n\nFor more than a century, L’Oréal has devoted itself solely to one business: beauty. We want to bring beauty to all people. Our goal is to win over another one billion consumers around the world by innovating and creating cosmetic and skincare products that meet the infinite diversity of their beauty needs and desires.\n\nThat’s about us… now what about you? You are driven and up for a challenge! You’re passionate about putting your best foot forward, but you’re not afraid to fail either. You love to learn, grow and make an impact on the world. You can be an intern, or at a senior level position, we’re always looking for new people to join our teams.\n\nIf you are ready to take charge of your career and join us, you’re one click away: https://careers.loreal.com/en_US/content\n\nInterested about our quest to the next billion consumers, follow us here to get the insider scoop on our business, culture, and tips on how to join us to shape the future of beauty.\n\nFreedom to go beyond, that’s the beauty of L’Oréal.",
    "website": "http://www.loreal.com",
    "industry": "Personal Care Product Manufacturing",
    "company_size": "10,001+ employees",
    "job_openings_text": "L'Oréal has 1,419 job openings - find the one for you."
  },
  {
    "company_slug": "nptel",
    "followers": "422K followers",
    "overview": "Welcome to NPTEL: Empowering India's Digital Education 🚀\n\nNPTEL (National Programme on Technology Enhanced Learning) is India's premier online platform that offers high-quality, free courses in various engineering, science, arts, and technology disciplines. Our mission is to democratize education by providing open-access digital learning resources to learners across the country, empowering them to shape a brighter future.\n\n🔹 **Our Mission:**\nTo bridge the knowledge gap and foster a culture of continuous learning, NPTEL brings together leading academicians and industry experts to create world-class educational content. We strive to equip learners with cutting-edge skills and knowledge essential for success in today's dynamic and competitive world.\n\n🔹 **Our Values:**\n- **Excellence:** We are committed to delivering top-notch educational content that meets the highest standards of quality and relevance.\n- **Inclusivity:** We believe in providing equal learning opportunities to every individual, regardless of their background or location.\n- **Innovation:** We continually evolve our courses and methodologies to stay ahead of the technological curve and enhance the learning experience.\n\n🔹 **Impact:**\nWith millions of learners and a vast network of academic institutions, NPTEL has made a profound impact on India's education landscape. We've empowered countless students, professionals, and enthusiasts to upskill, reskill, and thrive in their careers.\n\n🔹 **Join the NPTEL Community:**\nBecome a part of our growing community of learners, educators, and industry professionals. Stay updated with the latest courses, webinars, masterclasses, and knowledge-sharing events that can propel your career to new heights.\n\n🔹 **Contact Us:**\nFor inquiries, collaborations, or to learn more about our offerings, reach out to us at: support@nptel.iitm.ac.in\n\n#NPTEL #EducationForAll #SkillDevelopment #EmpoweringIndia",
    "website": "https://nptel.ac.in/",
    "industry": "E-Learning Providers",
    "company_size": "51-200 employees",
    "headquarters": "Chennai, Tamilnadu"
  },
  {
    "company_slug": "adani-group",
    "followers": "2M followers",
    "overview": "Adani Group is a diversified organisation in India comprising 10 publicly traded companies. It has created a world class transport and utility infrastructure portfolio that has a pan-India presence. Adani Group is headquartered in Ahmedabad, in the state of Gujarat, India. Over the years, Adani Group has positioned itself to be the market leader in its transport logistics and energy utility portfolio businesses focusing on large scale infrastructure development in India with O & M practices benchmarked to global standards. With four IG rated businesses, it is the only Infrastructure Investment Grade issuer in India.\n\nAdani owes its success and leadership position to its core philosophy of ‘Nation Building’ driven by ‘Growth with Goodness’ - a guiding principle for sustainable growth. Adani is committed to increase its ESG footprint by realigning its businesses with emphasis on climate protection and increasing community outreach through its CSR programme based on the principles of sustainability, diversity and shared values.\n\nWatch Pehle Pankha Ayega | Phir Bijli Aayegi : https://www.youtube.com/watch?v=1orXXuPzNmY",
    "website": "https://www.adani.com/",
    "industry": "Utilities",
    "company_size": "10,001+ employees",
    "job_openings_text": "Adani Group has 3 job openings - find the one for you."
  },
  {
    "company_slug": "capgemini",
    "followers": "8M followers",
    "overview": "Capgemini is a global business and technology transformation partner, helping organizations to accelerate their dual transition to a digital and sustainable world, while creating tangible impact for enterprises and society. It is a responsible and diverse group of 340,000 team members in more than 50 countries. With its strong over 55-year heritage, Capgemini is trusted by its clients to unlock the value of technology to address the entire breadth of their business needs. It delivers end-to-end services and solutions leveraging strengths from strategy and design to engineering, all fueled by its market leading capabilities in AI, generative AI, cloud and data, combined with its deep industry expertise and partner ecosystem. The Group reported 2024 global revenues of €22.1 billion.\n\nGet The Future You Want | www.capgemini.com",
    "website": "https://www.capgemini.com",
    "industry": "IT Services and IT Consulting",
    "company_size": "10,001+ employees",
    "headquarters": "Paris, France",
    "job_openings_text": "Capgemini has 7,437 job openings - find the one for you."
  },
  {
    "company_slug": "hcltech",
    "followers": "8M followers",
    "overview": "HCLTech is a global technology company, home to more than 223,000 people across 60 countries, delivering industry-leading capabilities centered around digital, engineering, cloud and AI, powered by a broad portfolio of technology services and products. We work with clients across all major verticals, providing industry solutions for Financial Services, Manufacturing, Life Sciences and Healthcare, High Tech, Semiconductor, Telecom and Media, Retail and CPG and Public Services. Consolidated revenues as of 12 months ending June 2025 totaled $14 billion. To learn how we can supercharge progress for you, visit hcltech.com.",
    "website": "http://www.hcltech.com",
    "industry": "IT Services and IT Consulting",
    "company_size": "10,001+ employees",
    "headquarters": "Noida, Uttar Pradesh",
    "job_openings_text": "HCLTech has 1,495 job openings - find the one for you."
  },
  {
    "company_slug": "pinterest",
    "followers": "1M followers",
    "overview": "Pinterest's mission is to bring everyone the inspiration to create a life they love. It's the visual inspiration platform where 482 million monthly active users worldwide come to search, save, and shop the best ideas in the world for all of life’s moments.",
    "website": "https://www.pinterest.com/",
    "industry": "Software Development",
    "company_size": "1,001-5,000 employees",
    "headquarters": "San Francisco, California",
    "job_openings_text": "Pinterest has 264 job openings - find the one for you."
  },
  {
    "company_slug": "unilever",
    "followers": "20M followers",
    "overview": "Be part of the world’s most successful, purpose-led business. Work with brands that are well-loved around the world, that improve the lives of our consumers and the communities around us. We promote innovation, big and small, to make our business win and grow; and we believe in business as a force for good. Unleash your curiosity, challenge ideas and disrupt processes; use your energy to make this happen. Our brilliant business leaders and colleagues provide mentorship and inspiration, so you can be at your best. \n\nOur portfolio ranges from nutritionally balanced foods to indulgent ice creams, affordable soaps, luxurious shampoos and everyday household care products. We produce world-leading brands including Lipton, Knorr, Dove, Axe, Hellmann’s and Omo, alongside trusted local names and innovative-forward thinking brands like Ben & Jerry’s, The Dollar Shave Club and Dermalogica. \n\nEvery individual here can bring their purpose to life through their work. Join us and you’ll be surrounded by inspiring leaders and supportive peers. Among them, you’ll channel your purpose, bring fresh ideas to the table, and simply be you. As you work to make a real impact on the business and the world, we’ll work to help you become a better you.",
    "website": "http://www.unilever.com",
    "industry": "Manufacturing",
    "company_size": "10,001+ employees",
    "headquarters": "Blackfriars, London",
    "job_openings_text": "Unilever has 484 job openings - find the one for you."
  },
  {
    "company_slug": "reliance",
    "followers": "5M followers",
    "overview": "Our motto “Growth is Life” aptly captures the ever-evolving spirit of Reliance. Our activities span hydrocarbon exploration and production, petroleum refining and marketing, petrochemicals, retail, and telecommunications. In each of these areas, we are committed to innovation-led, exponential growth. Our vision has pushed us to achieve global leadership in many of our businesses – including our position as the largest polyester yarn and fiber producer in the world. Reliance Industries Limited is a Fortune 500 company and the largest private sector corporation in India.\n\nAs Reliance sets sights on even more ambitious goals, we remain inspired and guided by the story and philosophy of our founder chairman Dhirubhai Ambani. Hailing from modest means, he followed his dream to create India's largest company. Reliance as an organization has adopted this ethos of converting adversity into opportunity and making the impossible possible by challenging conventional wisdom.\n\nOur ultimate aim has always been – and will always be – to touch the lives of people in a positive way",
    "website": "http://www.ril.com",
    "industry": "Oil and Gas",
    "company_size": "10,001+ employees",
    "headquarters": "Navi Mumbai, Maharashtra",
    "job_openings_text": "Reliance Industries Limited has 817 job openings - find the one for you."
  },
  {
    "company_slug": "procter-and-gamble",
    "followers": "8M followers",
    "overview": "P&G was founded more than 185 years ago as a soap and candle company. Today, we’re one of the world’s largest consumer goods companies and home to iconic, trusted brands, including Always®, Charmin®, Braun®, Fairy®, Febreze®, Gillette®, Head & Shoulders®, Oral B®, Pantene®, Pampers®, Tide®, and Vicks®. \n \nThe design, development, growth and success of these products—and many more—is thanks to the innovative and insightful minds of our people. From Day 1, you’ll help make everyday life easier for our 5 billion consumers. \n \nThere is no single equation for success at P&G, because no two P&G people or careers are alike. Just as we strive to deliver a superior consumer experience, we aim to deliver a superior employee value equation as well. With our large global footprint, there are many opportunities to work with P&G in multiple locations. We offer opportunities in approximately 70 countries and continually aim to attract, reward and advance the finest people in the world. \n \nHere, we want you to get your career off to a fast start. That's why we don't have any rotational development programs or gradual ramping-up periods: you’ll be able—and encouraged—to dive right in from Day 1. Join us and help make life better through meaningful work that makes an impact from Day 1.",
    "website": "http://www.pg.com",
    "industry": "Manufacturing",
    "company_size": "10,001+ employees",
    "headquarters": "Cincinnati, Ohio",
    "job_openings_text": "Procter & Gamble has 649 job openings - find the one for you."
  },
  {
    "company_slug": "hyperpurebyzomato",
    "followers": "66K followers",
    "overview": "Launched in 2019, Hyperpure is Eternal’s end-to-end restaurant solution, designed exclusively for the HoReCa (Hotels, Restaurants & Caterers) industry.\n\nWe provide professional kitchens with everything they need — from fresh produce, poultry, seafood, dairy, and dry goods to packaging essentials — all sourced responsibly and delivered through a robust farm-to-kitchen cold chain.\n\nHyperpure also supports menu innovation through our Culinary Development Centre and Food Park, helping partners standardise recipes, reduce prep time, and scale operations efficiently.\n\nToday, we serve over ~2 lakh food businesses across 100+ cities, supporting everyone from independent cafés to national restaurant chains.\n\nWhy Choose Hyperpure\n\nWe’re not just a supplier. We are a support system for professional kitchens.\n\n- Consistency You Can Trust: Sourcing directly from farmers and producers, maintaining strict cold chains, and ensuring products arrive kitchen-ready.\n\n- One Platform, All Essentials: Fresh ingredients, packaging, read-to-cook items, pre-cut vegetables and kitchen staples — all in one place, priced transparently.\n\n- Innovation Support: Helping restaurants test, standardise, and scale new menu ideas through our Culinary Development Centre and Food Park.\n\n- Built for Growth: Whether it’s a single café or a national chain, we help partners scale smoothly without compromising on quality.\n\nPartner with Hyperpure — and power the next chapter of your kitchen’s success.",
    "website": "https://www.hyperpure.com",
    "industry": "Food and Beverage Services",
    "company_size": "1,001-5,000 employees",
    "headquarters": "Gurugram, Haryana"
  },
  {
    "company_slug": "bluedart",
    "followers": "465K followers",
    "overview": "Blue Dart Express Ltd., South Asia's premier express air, integrated transportation & distribution company, offers secure and reliable delivery of consignments to over 56,000+ locations in India. Blue Dart is a provider of choice for its stakeholders due to its customer centric approach and aims to further strengthen this partnership. As part of DHL Group’s DHL eCommerce division, Blue Dart accesses the largest and most comprehensive express and logistics network worldwide, covering over 220 countries and territories, and offers an entire spectrum of distribution services including air express, freight forwarding, supply chain solutions, customs clearance etc.\n\nThe Blue Dart team drives market leadership through its motivated people, dedicated air and ground capacity, cutting-edge technology, wide range of innovative, vertical specific products and value-added services to deliver unmatched standards of service quality to its customers. Blue Dart's market leadership is further validated by its position as the nation’s most innovative and awarded express logistics company for exhibiting reliability, superior brand experience and sustainability which include recognition as one of ‘India's Best Companies to Work For’ by The Great Place to Work® Institute, India, ranked amongst ‘Best Multinational Workplaces in Asia’ by The Great Place to Work® Institute, Asia, voted a ‘Superbrand’ and ‘Reader’s Digest Most Trusted Brand’, listed as one of Fortune 500’s ‘India's Largest Corporations’ and Forbes ‘India's Super 50 Companies’ to name a few. Blue Dart’s Diversity and Inclusion initiatives have also led to it being recognized as one of India’s ‘Best Workplaces for Women’ in 2021 and ‘Best Organizations for Women’ in 2022 by the Economic Times.\n\nBlue Dart fulfils its social responsibility of climate protection (GoGreen), disaster management (GoHelp) and education (GoTeach) through its GoPrograms.",
    "website": "http://www.bluedart.com",
    "industry": "Transportation, Logistics, Supply Chain and Storage",
    "company_size": "10,001+ employees",
    "headquarters": "Mumbai, Maharashtra",
    "job_openings_text": "Blue Dart has 132 job openings - find the one for you."
  },
  {
    "company_slug": "ltimindtree",
    "followers": "5M followers",
    "overview": "LTIMindtree is a global technology consulting and digital solutions company that enables enterprises across industries to reimagine business models, accelerate innovation, and maximize growth by harnessing digital technologies. As a digital transformation partner to more than 700 clients, LTIMindtree brings extensive domain and technology expertise to help drive superior competitive differentiation, customer experiences, and business outcomes in a converging world. Powered by 86,000+ talented and entrepreneurial professionals across more than 30 countries, LTIMindtree — a Larsen & Toubro Group company — combines the industry-acclaimed strengths of erstwhile Larsen and Toubro Infotech and Mindtree in solving the most complex business challenges and delivering transformation at scale.\nFor more info, please visit www.ltimindtree.com.",
    "website": "http://www.ltimindtree.com",
    "industry": "IT Services and IT Consulting",
    "company_size": "10,001+ employees",
    "headquarters": "Mumbai, MH",
    "job_openings_text": "LTIMindtree has 841 job openings - find the one for you."
  },
  {
    "company_slug": "letsblinkit",
    "followers": "1M followers",
    "overview": "Blinkit (A Zomato Company) is a grocery and e-commerce platform.\n\nWe pioneered the instant delivery model in India with over 10 million Indians shopping on Blinkit, for everything from grocery staples and vegetables to emergency supplies and electronics, and much more.\n\nIf our mission interests you, send your CV to future@blinkit.com",
    "website": "https://www.blinkit.com",
    "industry": "Technology, Information and Internet",
    "company_size": "1,001-5,000 employees",
    "headquarters": "Gurgaon, Haryana"
  },
  {
    "company_slug": "flipkart",
    "followers": "5M followers",
    "overview": "At Flipkart, we're driven by our purpose of empowering every Indian's dream by delivering value through innovation in technology and commerce. With a customer base of over 350 million, product coverage of over 150 million across 80+ categories, a focus on generating direct and indirect employment and a commitment to empowering generations of entrepreneurs and MSMEs, all driven by a sustainable growth strategy – Flipkart is maximising for customers, stakeholders, and the planet at large!\n\nAt Flipkart, our promise to every Flipster is - getting an opportunity to leave a mark and create their own legacy, the freedom to experiment, learn and grow, work with the industry’s brightest minds as part of a diverse team and we will extend our culture of care to them to ensure that they can focus on doing their best work.\n \nDriven by audacity, bias for action, customer first, integrity and inclusion – Flipsters have pioneered solutions that have transformed digital commerce in India. From the industry-first introduction of cash-on-delivery in 2010 to the launch of voice search and multiple vernacular interfaces in 2021 that have made e-commerce a very inclusive experience, Flipkart continues the exciting journey of solving for the Indian customer.\n \nWe understand that your own aspirations and journeys are unique. So you choose what you want to maximise, and we provide you the platform for it - because when you maximise, we maximise.  \n \nFlipkart is a part of the Walmart-owned Flipkart Group, which also includes group companies Flipkart Wholesale, Flipkart Health+, Cleartrip, and Myntra.\n\nGet in touch with our experts for support with your orders here: https://www.flipkart.com/helpcentre",
    "website": "https://www.flipkart.com",
    "industry": "Technology, Information and Internet",
    "company_size": "10,001+ employees",
    "headquarters": "Bangalore, Karnataka",
    "job_openings_text": "Flipkart has 29 job openings - find the one for you."
  },
  {
    "company_slug": "geeksforgeeks",
    "followers": "3M followers",
    "overview": "With the idea of imparting programming knowledge, Mr. Sandeep Jain, an IIT Roorkee alumnus started a dream- GeeksforGeeks. Whether programming excites you or you feel stifled, wondering how to prepare for interview questions or how to ace data structures and algorithms, GeeksforGeeks is the one-stop solution for you.\nWith every tick of time, we are adding arrows in our quiver. From articles on various computer science subjects to programming problems for practice, from basic to premium courses, from technologies to entrance examinations, we have been building ample content with superior quality.\n\nIn a short span, we have built a community of 20 Million+ Geeks around the world, 20,000+ Contributors and 500+ Campus Ambassadors in various colleges across the nation. Our success stories include a lot of students who benefited in their placements and landed jobs at tech giants.\n\nSo start exploring the plethora of resources that GeeksforGeeks has to offer and start your journey of becoming more skilled and employable!",
    "website": "https://www.geeksforgeeks.org/courses",
    "industry": "Education",
    "company_size": "201-500 employees",
    "headquarters": "NOIDA, G. B. Nagar, Uttar Pradesh"
  },
  {
    "company_slug": "state-bank-of-india",
    "followers": "4M followers",
    "overview": "We are the largest Indian Public Sector Banking & Financial Services Company. Headquartered in Mumbai, our national presence across the country with over 22,000 branches and globally across all time-zones at 227 locations in 30 countries, makes us the leader in the sector.\n\nOur legacy ranges back to the British era through the Imperial Bank of India, founded in 1806. Today, we are a conglomerate employing skilled professionals who are successfully taking the legacy forward through our specialized and customized financial services designed to cater the needs of Corporates, SMEs, NRIs & Retail customers.\n \nFor more information about Career & Life at SBI, please visit :  https://bank.sbi/web/careers\n\nDisclaimer: SBI shall bear no responsibility for confidentiality of information shared with SBI through LinkedIn.",
    "website": "https://bank.sbi",
    "industry": "Banking",
    "company_size": "10,001+ employees",
    "headquarters": "Mumbai, Maharashtra"
  },
  {
    "company_slug": "british-airways",
    "followers": "1M followers",
    "overview": "As a global airline and the UK’s flag carrier, British Airways has been flying its customers to where they need to be for more than 100 years. The airline connects Britain with the world and the world with Britain, operating one of the most extensive international scheduled airline route networks together with its joint business, codeshare and franchise partners.\n \nTogether with its affiliates, British Airways operates to around 200 destinations in over 75 countries throughout Europe, North America, South America, Asia, Africa and Australia.\n \nIn September 2021, British Airways launched its sustainability programme, BA Better World, committing to put sustainability at the heart of everything it does and with a clear roadmap to achieve net zero carbon emissions by 2050. \n\nUnfortunately, we're unable to answer any specific customer service queries here. If you need to contact someone about our service or need immediate assistance, please DM us directly on Instagram, Facebook or X.",
    "website": "http://www.ba.com",
    "industry": "Airlines and Aviation",
    "company_size": "10,001+ employees",
    "job_openings_text": "British Airways has 36 job openings - find the one for you."
  },
  {
    "company_slug": "delhivery",
    "followers": "1M followers",
    "overview": "#WeGoTheExtraMile | We are India’s largest fully integrated logistics provider, simplifying commerce with cutting-edge technology, world-class infrastructure, and unmatched expertise to deliver seamless supply chain solutions for businesses of all sizes.\n\n\n\nComprehensive Solutions for Every Need\n➡️Express Parcel: Send shipments across India, including heavy goods, with value-added services like real-time tracking, NDR Management, Whatsapp based updates and RTO reduction tools.\n➡️Supply Chain Solutions: Store and manage inventory at optimized locations across India, fulfilling orders for both B2B and B2C channels with precision.\n➡️Partial Truckload (PTL): Leverage one of India’s largest PTL networks for door-to-door and hub-to-hub delivery, with multimodal freight options and advanced client dashboards.\n➡️Full Truckload (FTL): Handle high-volume shipments with speed and efficiency through our professional network of truckload partners and our own fleet.\n➡️Cross-Border Services: Ship parcels and freight to 220+ countries with door-to-door and port-to-port logistics powered by partnerships with global leaders like FedEx and Aramex.\n➡️OS1 for Seamless Logistics Operations: Our transformative operating system that addresses rising supply chain costs and inefficiencies, offering end-to-end visibility and improved operational efficiency.\n\nOur Impact at Scale\n✔️3 Billion+ parcels shipped since inception.\n✔️Coverage of 99.5% of India’s population; unparalleled reach.\n✔️Trusted by 33,000+ businesses to drive logistics operations.\n✔️Shipped over 4.3 Million tonnes of freight.\n✔️Managing 18.8 Million+ sqft of logistics infrastructure.\n\nWhy choose Delhivery: We don’t just move goods—we move businesses forward. Our robust ecosystem helps enterprises optimize supply chains, scale operations, and achieve excellence. \n\n📞For shipment queries, \nVisit: https://www.delhivery.com/support or \nDM: https://www.linkedin.com/showcase/delhivery-support",
    "website": "https://www.delhivery.com/",
    "industry": "Transportation, Logistics, Supply Chain and Storage",
    "company_size": "10,001+ employees",
    "headquarters": "Gurgaon, Haryana",
    "job_openings_text": "Delhivery has 15 job openings - find the one for you."
  },
  {
    "company_slug": "telusdigitalaidatasolutions",
    "followers": "402K followers",
    "overview": "TELUS Digital AI & Data Solutions partners with a diverse and vibrant community to help our customers enhance their AI and machine learning models. The work of our AI Community contributes to improving technology and the digital experiences of many people around the world. Our AI Community works in our proprietary AI training platform handling all data types (text, images, audio, video and geo) across 500+ languages and dialects. We offer flexible work-from-home opportunities and Onsite jobs in many regions for people with a passion for languages. We have both part-time jobs with no fixed schedule and onsite full-time jobs. Whoever you are, wherever you come from, come join our global AI Community. www.telusdigital.com",
    "website": "https://www.telusdigital.com/careers",
    "industry": "IT Services and IT Consulting",
    "company_size": "10,001+ employees",
    "headquarters": "Las Vegas, Nevada",
    "job_openings_text": "TELUS Digital AI Data Solutions has 4,901 job openings - find the one for you."
  },
  {
    "company_slug": "appen",
    "followers": "1M followers",
    "overview": "Appen has been a leader in AI training data for over 25 years, providing high-quality, diverse datasets that power the world's leading AI models. Our end-to-end platform, deep expertise, and scalable human-in-the-loop services enable AI innovators to build and optimize cutting-edge models. \n\nWe specialize in creating bespoke, human-generated data to train, fine-tune, and evaluate AI models across multiple domains, including generative AI, large language models (LLMs), computer vision, speech recognition, and more. Our solutions support critical AI functions such as supervised fine-tuning, reinforcement learning with human feedback (RLHF), model evaluation, and bias mitigation. \n\nOur advanced AI-assisted data annotation platform, combined with a global crowd of more than 1M contributors in over 200 countries, ensures the delivery of accurate and diverse datasets. Our commitment to quality, scalability, and ethical AI practices makes Appen a trusted partner for enterprises aiming to develop and deploy effective AI solutions. \n\nAt Appen, we foster a culture of innovation, collaboration, and excellence. We value curiosity, accountability, and a commitment to delivering the highest-quality AI solutions. We support work-life balance with flexible work arrangements and a dynamic, results-driven environment. Employees have access to competitive pay, comprehensive benefits, and opportunities for continuous learning and career growth.  \n\nOur team works closely with the world’s top technology companies and enterprises, tackling exciting challenges and shaping the future of artificial intelligence.",
    "website": "http://appen.com",
    "industry": "IT Services and IT Consulting",
    "company_size": "501-1,000 employees",
    "headquarters": "Kirkland, Washington",
    "job_openings_text": "Appen has 75 job openings - find the one for you."
  },
  {
    "company_slug": "welocalize",
    "followers": "363K followers",
    "overview": "For over 25 years, Welocalize has helped some of the world's largest organizations improve customer engagement through the power of localized content. Since our founding in 1997, we've been a leader in applying innovative technology and adopting AI to deliver the highest quality translations quickly, efficiently, and at scale. Our proven track record showcases tangible business outcomes, including higher marketing conversion rates, regulatory compliance, increased customer satisfaction and retention, intellectual property protection, higher adoption rates, and improved data with enhanced models.\n\nAt the heart of our innovation is OPAL, our advanced Service Delivery Platform, ensuring every translation is fast, effortless, and impeccably accurate. This technology, combined with our extensive network of over 250,000 linguistic experts in more than 250 languages, allows us to deliver multilingual content transformation services that are unmatched in quality and relevance.\n\nOur global team of industry specialists is dedicated to enabling your teams to achieve global business outcomes. From translation and localization to NLP-enabled machine learning training data, and data annotation, we blend cutting-edge technology with human insight across every project.",
    "website": "http://www.welocalize.com",
    "industry": "Translation and Localization",
    "company_size": "1,001-5,000 employees",
    "headquarters": "New York, NY",
    "job_openings_text": "Welocalize has 61 job openings - find the one for you."
  },
  {
    "company_slug": "it-associates",
    "followers": "144K followers",
    "overview": "IT Associates is a boutique IT staffing and recruiting firm that provides full service contract, contract for hire, direct placement, pay rolling, and co-managed services nationwide. At ITA, our happy place is helping you find your happy place.  Our 20 years of industry experience has allowed us to build deep lasting relationships and given us the ability to connect our clients with passionate IT professionals nationwide. ITA is all about delivering the right fit at the right time, every time. \n\nTo know more about us and see a list of all our open positions, visit www.itassociatesinc.com\n\n“I've worked closely with IT Associates during my job search and have found My Recruiter to be very professional and dedicated during the entire process.   My Recruiter doesn't simply throw every posting at you, but rather focuses on finding the right mixture of a client’s culture / requirements and a consultant’s personality, skills and experiences.”\n       ~  Sr Project Manager\n\nThe major differentiator as to why IT Associates is a preferred provider is  the quality of the resources delivered and the fast timeframe they are able to fill the request. I consider them the go to Company when we need high quality resources in specialized domains quickly. They are easy to do business with, honor their commitments and are a really great partner.\n               ~  Global CIO, Multi Billion dollar IT services company\n\n\nKnow someone who would be a great fit for any IT Associates opportunities ? We offer upto $500 for forwarding us a referral that results in a successful placement.",
    "website": "http://www.itassociatesinc.com",
    "industry": "IT Services and IT Consulting",
    "company_size": "51-200 employees",
    "headquarters": "Warrenville, Illinois",
    "job_openings_text": "IT Associates has 16 job openings - find the one for you."
  },
  {
    "company_slug": "mphasis",
    "followers": "1M followers",
    "overview": "A leading applied technology services company, we innovate to deliver service excellence and successful outcomes across sales, delivery and development. With our strategy to be agile, nimble and customer-centric, we anticipate the future of applied technology and predict tomorrow’s trends to keep our clients at the summit in an ever-changing marketplace. Leading with architecture and design, our next-gen solutions enable enterprises to accelerate on their digital transformation journey.\n \nCustomer centricity is foundational to us and is reflected in the Mphasis’ Front2Back™ (F2B) transformation approach.  F2B is a customer-in view approach that uses our industry-specific X2C2TM framework, and harnesses the power of cognitive technologies and rich data resident in enterprises to transform them. It is a way to introduce disruptive technology to smartly transform legacy environments. . Mphasis’ Service Transformation approach helps ‘shrink the core’ through the application of digital technologies across legacy environments within an enterprise, enabling businesses to stay ahead in a changing world. Mphasis’ core reference architectures and tools, speed and innovation with domain expertise and specialization are key to building strong relationships with marquee clients. Click here to know more\n \nMphasis Presents #HowGeekAreYou\nPassion, Perseverance, Perfection – we are defined by these three words. Relentless in our pursuit of knowledge, we believe in accepting the difference and defining the 'new normal', staying true to our vision and values. We believe in growth by knowledge, responsibility by authority and freedom by flexibility. \n\nBe a part of a place where ideas are celebrated and perseverance is worshiped. Our doors are wide open, and breakthrough ideas are welcome from anyone. But we have a question to ask before we let you in: How Geek Are You?\nClick here to know more.",
    "website": "https://www.mphasis.com/",
    "industry": "IT Services and IT Consulting",
    "company_size": "10,001+ employees",
    "headquarters": "Bangalore, Karnataka",
    "job_openings_text": "Mphasis has 223 job openings - find the one for you."
  },
  {
    "company_slug": "freelancerscommunity",
    "followers": "",
    "overview": "",
    "industry": "",
    "company_size": ""
  },
  {
    "company_slug": "recrutement-dz",
    "followers": "212K followers",
    "overview": "🔹 مرحباً بكم في صفحة Recrutement-dz\nنحن متخصصون في نشر عروض العمل وطلبات التوظيف، كما نوفر خدمة إعداد وإرسال السير الذاتية للشركات حسب المتطلبات.\n\n✅ لإرسال طلبك أو سيرتك الذاتية:\n🔗 https://t.me/+5HQL1id3lOU0YmY8\n\n📩 لإرسال عروض التوظيف:\n📧 recherchedemploidz@gmail.com\n\n📢 تابعوا أحدث عروض العمل:\n🔸 بالعربية: https://lnkd.in/eP9f4N4b\n🔸 بالفرنسية والإنجليزية: https://t.me/rcrdz1\n\n📱 راسلنا على واتساب مباشرة:\n👉 https://wa.me/message/Y5N3CV7P6PLOD1",
    "industry": "Research Services",
    "company_size": "2-10 employees"
  },
  {
    "company_slug": "moneycontrol",
    "followers": "1M followers",
    "overview": "Moneycontrol is  India's No 1 Financial and Business portal. With in-depth market coverage, analysis, expert opinions and a gamut of financial tools, moneycontrol.com has been the premier destination for consumers and market watchers. A part of Network18, moneycontrol.com is the most influential destination for stock market news and advice, business news and news about the Indian and global economy.",
    "website": "http://www.moneycontrol.com",
    "industry": "Technology, Information and Internet",
    "company_size": "501-1,000 employees",
    "headquarters": "Mumbai, Maharashtra"
  },
  {
    "company_slug": "snowflake-computing",
    "followers": "1M followers",
    "overview": "Snowflake delivers the AI Data Cloud — a global network where thousands of organizations mobilize data with near-unlimited scale, concurrency, and performance. Inside the AI Data Cloud, organizations unite their siloed data, easily discover and securely share governed data, and execute diverse analytic workloads. Wherever data or users live, Snowflake delivers a single and seamless experience across multiple public clouds. Snowflake’s platform is the engine that powers and provides access to the AI Data Cloud, creating a solution for data warehousing, data lakes, data engineering, data science, data application development, and data sharing. Join Snowflake customers, partners, and data providers already taking their businesses to new frontiers in the AI Data Cloud.\n\nhttp://www.snowflake.com",
    "website": "http://www.snowflake.com",
    "industry": "Software Development",
    "company_size": "5,001-10,000 employees",
    "job_openings_text": "Snowflake has 526 job openings - find the one for you."
  },
  {
    "company_slug": "mscmsit",
    "followers": "2K followers",
    "overview": "Welcome to the hub of tech brilliance! Brace yourself for an exhilarating ride with us!\nOpen to all!🎮🌐",
    "industry": "Technology, Information and Internet",
    "company_size": "2-10 employees",
    "headquarters": "Delhi, Delhi"
  },
  {
    "company_slug": "medymaticbusinesssolutions",
    "followers": "2K followers",
    "overview": "At MedyMatic Business Solutions, we specialize in providing comprehensive revenue cycle management (RCM) and medical billing services tailored to meet the unique needs of healthcare providers.\nWe believe that our success is driven by our people. We are committed to fostering a workplace that values integrity, transparency, and mutual respect. As part of our team, you will be part of a company that not only excels in revenue cycle management but also prioritizes ethical practices and employee well-being.",
    "website": "https://medymatic.com",
    "industry": "IT Services and IT Consulting",
    "company_size": "2-10 employees",
    "headquarters": "Nagpur, Maharashtra"
  },
  {
    "company_slug": "pre-hackathon",
    "followers": "691 followers",
    "overview": "ارشاد وتوجيه متخصص🚀 | مجتمع شبابي مفكر طموح نحو الإبداع والتميز💫 #PreHack",
    "website": "https://x.com/prehackathon?s=21",
    "industry": "Technology, Information and Internet",
    "company_size": "2-10 employees",
    "headquarters": "الطائف, منطقة مكة المكرمة"
  },
  {
    "company_slug": "indehub",
    "followers": "1K followers",
    "overview": "Hey there! Welcome to indehub – a vibrant tech community for innovators!\n\nWe’re all about monthly meetups and workshops diving into the latest in tech, design, and development. Our goal? To build a super supportive and healthy community, starting right here in India.\n\nCome join us, meet awesome people, and let's have a great time growing and learning together!",
    "website": "https://indehub.org/",
    "industry": "Technology, Information and Internet",
    "company_size": "0-1 employees",
    "headquarters": "Chennai, Tamil Nadu"
  },
  {
    "company_slug": "infinite-computer-solutions",
    "followers": "304K followers",
    "overview": "Infinite is a global technology solution provider headquartered in Rockville, Md. The company provides business technology solutions and product engineering services for telecom, hi-tech, healthcare, media & entertainment, insurance, banking & financial services, retail, public sector, travel and transport, and government. With the proprietary frameworks, platforms, accelerators, and domain experts, Infinite has been solving challenges for Fortune 1000 companies since 2001. Core service offerings include business transformation, digitalization, cloud services, application development management services, quality engineering and assurance, product/platform engineering, and infrastructure services. For more information, please visit www.infinite.com.",
    "website": "https://www.infinite.com/",
    "industry": "IT Services and IT Consulting",
    "company_size": "10,001+ employees",
    "headquarters": "Rockville, Maryland",
    "job_openings_text": "Infinite Computer Solutions has 47 job openings - find the one for you."
  },
  {
    "company_slug": "lokam-ai",
    "followers": "1K followers",
    "overview": "Lokam.ai turns every phone conversation into revenue and 5-star reviews for automotive service centers.\n\nOur Voice AI holds human-like, open-ended conversations after each service visit, uncovering what customers really feel : no tedious “rate us 1-10” surveys.\n• Natural feedback calls in 30+ languages & accents\n• Real-time sentiment engine pinpoints praise, pain points, and urgency\n• Automatic actions fire instantly:\n— Happy? → text review link or loyalty coupon\n— Unhappy? → escalate to Service Manager before it hits Google\n\nThe same platform handles inbound calls 24/7—answering FAQs, routing to the right advisor, and booking appointments so you never miss a customer.\n\nA live dashboard aggregates every call, trend, and advisor metric, giving leaders the clarity to fix issues fast and double-down on what works.\n\nOutcomes we deliver\n\nNever Miss a Customer or Booking\nBoost NPS & CSI Scores Instantly\nActionable Insights with Zero Manual Work\nCatch Issues Before They Become 1-Star Reviews",
    "website": "https://lokam.ai",
    "industry": "Software Development",
    "company_size": "2-10 employees",
    "headquarters": "Bangalore, Karnataka"
  },
  {
    "company_slug": "rbl-bank",
    "followers": "719K followers",
    "overview": "RBL Bank is one of India’s fastest growing private sector banks with an expanding presence across the country. The Bank offers specialized services under six business verticals namely: Corporate & Institutional Banking, Commercial Banking, Branch & Business Banking, Retail Assets and Treasury and Financial Markets Operations. It currently services over 11.53 million customers through a network of 517 branches; 1,166 business correspondent branches (of which 298 banking outlets) and 414 ATMs spread across 28 Indian states and Union Territories. \n\nRBL Bank is listed on both NSE and BSE (RBLBANK). \n\nFor further details, please visit https://www.rblbank.com\nRBL Bank Blog - https://blog.rblbank.com/",
    "website": "https://www.rblbank.com",
    "industry": "Banking",
    "company_size": "5,001-10,000 employees",
    "headquarters": "Mumbai, Maharashtra"
  },
  {
    "company_slug": "atomcodetechnology",
    "followers": "93K followers",
    "overview": "Asia's Leading Talent Platform 💼\nAI-powered Job Search | Featured Profiles | Courses | Skill Assessments\nOfficial Talent Partner – BWF 🏸",
    "website": "https://www.atomcode.a.i/",
    "industry": "Technology, Information and Internet",
    "company_size": "501-1,000 employees"
  },
  {
    "company_slug": "talro",
    "followers": "2K followers",
    "website": "https://www.talentrouters.com",
    "industry": "IT Services and IT Consulting",
    "company_size": "2-10 employees",
    "headquarters": "Chennai, Tamil Nadu",
    "job_openings_text": "TalentRouters has 1 job opening - find the one for you."
  },
  {
    "company_slug": "yellow-aia",
    "followers": "2K followers",
    "industry": "IT Services and IT Consulting",
    "company_size": "11-50 employees"
  },
  {
    "company_slug": "itminds-llc",
    "followers": "133K followers",
    "overview": "IT Minds LLC provides the resources for long and short-term contracts. It also offers various product services.\n\nInformation Technology , Pharmaceutical , Regulatory Affairs and Health Care Staffing, Product Development, On-site Customer Services, etc. are some of our services.\n\nWe have over 15 years of experience placing information technology professionals in permanent positions and consulting assignments. At any level, on any platform, we provide quality professionals in quality positions.\n\nWe always look forward to long-term relationships with our client companies and our candidates. This has kept us successful all these years. We are well aware all this isn't about just one assignment or one placement. It is about the connection and trust that we build. We'd always be happy to meet with you to help identify your needs. Then we can serve you with exemplary service.\n\nOver the years, we've worked with a wide range of clientele— Client companies may be small or big, yet they run the most highly respected businesses. We strive for quality and seek to earn business with every job order. We are open and looking forward to serving new clients every day!\n\nWe provide personalized service and are responsive to our client's staffing needs. Our business has grown over the years and continues to grow through referrals. Our most excellent satisfaction comes when the process goes complete cycle, and a candidate becomes a client because of our high-quality service.\n \nWe have a successful track record in many places. We pride ourselves on making mutually beneficial matches between job seekers and our corporate clients and go to great lengths to ensure that each satisfies the needs and expectations of the other. We do so by taking the time to thoroughly understand the specific needs of each of our clients and then using proprietary recruitment techniques to pinpoint the most suitable job candidates. We also understand what it takes to help get the job done.",
    "website": "http://www.itminds.net",
    "industry": "IT Services and IT Consulting",
    "company_size": "51-200 employees",
    "headquarters": "Irvine, California",
    "job_openings_text": "IT Minds LLC has 39 job openings - find the one for you."
  },
  {
    "company_slug": "genpact",
    "followers": "5M followers",
    "overview": "Genpact (NYSE: G) is an advanced technology services and solutions company that delivers lasting value for leading enterprises globally. Through our deep business knowledge, operational excellence, and cutting-edge solutions – we help companies across industries get ahead and stay ahead. Powered by curiosity, courage, and innovation, our teams implement data, technology, and AI to create tomorrow, today. Get to know us at www.genpact.com and on the following social handles:\nX: https://twitter.com/genpact\nFacebook: https://www.facebook.com/ProudToBeGenpact/\nInstagram: https://www.instagram.com/genpact_global/\nYouTube: https://www.youtube.com/@GenpactGlobal\n\n** Beware of fake offers**\nGenpact never requires applicants to pay to be part of our hiring process.\nIf you receive an email asking you to purchase a starter kit, equipment, or training, or to pay to apply for a role, you can assume that the message is a scam. For more information on careers at Genpact, please visit us at https://www.genpact.com/careers",
    "website": "http://www.genpact.com",
    "industry": "Business Consulting and Services",
    "company_size": "10,001+ employees",
    "headquarters": "New York, NY",
    "job_openings_text": "Genpact has 242 job openings - find the one for you."
  },
  {
    "company_slug": "deloitte",
    "followers": "19M followers",
    "overview": "Deloitte drives progress. Our firms around the world help clients become leaders wherever they choose to compete. Deloitte invests in outstanding people of diverse talents and backgrounds and empowers them to achieve more than they could elsewhere. Our work combines advice with action and integrity. We believe that when our clients and society are stronger, so are we. \n\nDeloitte refers to one or more of Deloitte Touche Tohmatsu Limited (“DTTL”), its global network of member firms, and their related entities. DTTL (also referred to as “Deloitte Global”) and each of its member firms are legally separate and independent entities. DTTL does not provide services to clients. Please see www.deloitte.com/about to learn more.\n\nThe content on this page contains general information only, and none of Deloitte Touche Tohmatsu Limited, its member firms, or their related entities (collectively the “Deloitte Network”) is, by means of this publication, rendering professional advice or services. Before making any decision or taking any action that may affect your finances or your business, you should consult a qualified professional adviser. No entity in the Deloitte Network shall be responsible for any loss whatsoever sustained by any person who relies on content from this page.",
    "website": "http://www.deloitte.com/",
    "industry": "Business Consulting and Services",
    "company_size": "10,001+ employees",
    "job_openings_text": "Deloitte has 24,049 job openings - find the one for you."
  },
  {
    "company_slug": "accenture",
    "followers": "14M followers",
    "overview": "Accenture is a leading global professional services company that helps the world’s leading businesses, governments and other organizations build their digital core, optimize their operations, accelerate revenue growth and enhance citizen services—creating tangible value at speed and scale.\n \nWe are a talent and innovation-led company serving clients in more than 120 countries. We combine our strength in technology and leadership in cloud, data and AI with unmatched industry experience, functional expertise and global delivery capability. We measure our success by the 360° value we create for our clients, each other, our shareholders, partners and communities.\n\nThis LinkedIn company page is moderated. When engaging with Accenture, we encourage everyone to:\n\n- Use common courtesy and be respectful of others.\n- Create your own original content and avoid content that you know to be fraudulent.\n- Never repost someone else's copyrighted work, unless you have permission.\n- Never post personal, identifying, or confidential information.\n\nWe reserve the right to delete comments or posts we deem to be:\n\n- Profane, obscene, inappropriate, offensive, abusive material.\n- Spam, repeated comments and commercial messages and personal advertisements.\n- Discriminatory or that contain hateful speech of any kind regarding age, gender, race, religion, nationality, sexual orientation, gender identity or disability.\n- Threats; personal attacks; abusive, defamatory, derogatory, or inflammatory language; or stalking or harassment of any individual, entity or organization.\n- False, inaccurate, libelous, or otherwise misleading in any way.",
    "website": "http://www.accenture.com",
    "industry": "Business Consulting and Services",
    "company_size": "10,001+ employees",
    "job_openings_text": "Accenture has 28,099 job openings - find the one for you."
  },
  {
    "company_slug": "tata-motors",
    "followers": "6M followers",
    "overview": "Tata Motors Group (Tata Motors) is a leading global automobile manufacturing company. Its diverse portfolio includes an extensive range of cars, sports utility vehicles, trucks, buses and defence vehicles. The Tata Motors Group’s over 80,000 employees are guided by the mission “to innovate mobility solutions with passion to enhance quality of life\".",
    "website": "http://www.tatamotors.com",
    "industry": "Motor Vehicle Manufacturing",
    "company_size": "10,001+ employees",
    "headquarters": "Pune, Maharashtra",
    "job_openings_text": "Tata Motors has 1 job opening - find the one for you."
  },
  {
    "company_slug": "ernstandyoung",
    "followers": "10M followers",
    "overview": "EY is building a better working world by creating new value for clients, people, society, the planet, while building trust in the capital markets.\n\nEnabled by data, AI and advanced technology, EY teams help clients shape the future with confidence and develop answers for the most pressing issues of today and tomorrow.\n\nEY teams in more than 150 countries work across a full spectrum of services in assurance, consulting, tax, strategy and transactions, strengthened by sector experience and diverse ecosystem partners.\n \nFind out more about the EY global network: http://ey.com/en_gl/legal-statement",
    "website": "http://www.ey.com",
    "industry": "Professional Services",
    "company_size": "10,001+ employees",
    "job_openings_text": "EY has 23,335 job openings - find the one for you."
  },
  {
    "company_slug": "mckinsey",
    "followers": "7M followers",
    "overview": "McKinsey & Company is a global management consulting firm. We are the trusted advisor to the world's leading businesses, governments, and institutions. \n\nWe work with leading organizations across the private, public and social sectors. Our scale, scope, and knowledge allow us to address problems that no one else can. We have deep functional and industry expertise as well as breadth of geographical reach. We are passionate about taking on immense challenges that matter to our clients and, often, to the world. \n\nWe work with our clients as we do with our colleagues. We build their capabilities and leadership skills at every level and every opportunity. We do this to help build internal support, get to real issues, and reach practical recommendations. We bring out the capabilities of clients to fully participate in the process and lead the ongoing work.",
    "website": "http://www.mckinsey.com",
    "industry": "Business Consulting and Services",
    "company_size": "10,001+ employees",
    "job_openings_text": "McKinsey & Company has 603 job openings - find the one for you."
  },
  {
    "company_slug": "pwc",
    "followers": "7M followers",
    "overview": "At PwC, we help clients drive their companies to the leading edge. We’re a tech-forward, people-empowered network with more than 370,000 people in 149 countries. Across audit and assurance, tax and legal, deals and consulting we help build, accelerate and sustain momentum. Find out more at www.pwc.com.\n\nPwC: Audit and assurance, consulting and tax services\nPwC refers to the PwC network and/or one or more of its member firms, each of which is a separate legal entity. Content on this page has been prepared for general information only and is not intended to be relied upon as accounting, tax or professional advice. Please reach out to your advisors for specific advice.",
    "website": "https://www.pwc.com/gx/en",
    "industry": "Professional Services",
    "company_size": "10,001+ employees",
    "job_openings_text": "PwC has 19,749 job openings - find the one for you."
  },
  {
    "company_slug": "generating-technology-impact",
    "followers": "3K followers",
    "overview": "We design, transform, and run advanced operations that leverage technologies targeted for measurable impact and data-driven action. We know what works—because we use it.",
    "website": "http://www.genpact.com",
    "industry": "IT Services and IT Consulting"
  },
  {
    "company_slug": "financial-services-regulatory-authority-of-ontario",
    "followers": "41K followers",
    "overview": "The Financial Services Regulatory Authority of Ontario (FSRA) is a new, independent regulatory agency created to improve consumer and pension plan beneficiary protections in Ontario.\n\nFSRA was established to replace the Financial Services Commission of Ontario (FSCO) and the Deposit Insurance Corporation of Ontario (DICO). The agency is flexible, self-funded and designed to respond rapidly to an evolving commercial and consumer environment. In this capacity, FSRA will: \n\n• Promote high standards of business conduct\n• Foster a sustainable, competitive financial services sector\n• Respond to market changes quickly\n• Promote good administration of insurance and pension plans\n• Encourage innovation\n\nThe newly created agency protects Ontarians by regulating:\n\n• Property and casualty insurance\n• Life and health insurance\n• Credit unions and caisses populaires\n• Loan and trust companies\n• Mortgage brokers\n• Health services providers (related to auto insurance)\n• Pension plan administrators\n• Financial planners and advisors\n \nFor more information, visit www.fsrao.ca",
    "website": "http://www.fsrao.ca",
    "industry": "Financial Services",
    "company_size": "501-1,000 employees",
    "headquarters": "North York, ON",
    "job_openings_text": "Financial Services Regulatory Authority of Ontario (FSRA) has 7 job openings - find the one for you."
  },
  {
    "company_slug": "ontario-securities-commission",
    "followers": "29K followers",
    "overview": "The Ontario Securities Commission administers and enforces securities law in the province of Ontario. The mandate of the OSC is to provide protection to investors from unfair, improper or fraudulent practices, to foster fair, efficient and competitive capital markets and confidence in the capital markets, to foster capital formation, and to contribute to the stability of the financial system and the reduction of systemic risk.",
    "website": "http://www.osc.ca",
    "industry": "Capital Markets",
    "company_size": "501-1,000 employees",
    "headquarters": "Toronto, ON",
    "job_openings_text": "Ontario Securities Commission has 10 job openings - find the one for you."
  },
  {
    "company_slug": "osfi-bsif",
    "followers": "31K followers",
    "overview": "The Office of the Superintendent of Financial Institutions (OSFI) is an independent agency of the Government of Canada, established in 1987 to contribute to the safety and soundness of the Canadian financial system. OSFI supervises and regulates federally registered banks and insurers, trust and loan companies, as well as private pension plans subject to federal oversight.\n\nTerms of use -https://www.osfi-bsif.gc.ca/en/terms-conditions\n\nJob Opportunities - https://www.osfi-bsif.gc.ca/en/careers/job-opportunities-osfi\n\n---------------------------------- \n\nLe Bureau du surintendant des institutions financières (BSIF) est un organisme indépendant du gouvernement du Canada, établi en 1987 dans le but de rehausser la sûreté et la solidité du système financier canadien. Il surveille et réglemente les banques et les sociétés d'assurances, les sociétés de fiducie et de prêt, ainsi que les régimes de retraite privés de compétence fédérale.\n\nAvis sur l'utilisation de la page - https://www.osfi-bsif.gc.ca/fr/avis\n\nCarrières - https://www.osfi-bsif.gc.ca/en/careers/job-opportunities-osfi",
    "website": "http://www.osfi-bsif.gc.ca",
    "industry": "Government Administration",
    "company_size": "1,001-5,000 employees",
    "headquarters": "Ottawa, Ontario"
  },
  {
    "company_slug": "fintrac-canafe",
    "followers": "40K followers",
    "overview": "The Financial Transactions and Reports Analysis Centre of Canada (FINTRAC) is Canada's financial intelligence unit and anti-money laundering and anti-terrorist financing supervisor. Its mandate is to facilitate the detection, prevention and deterrence of money laundering and the financing of terrorist activities, while ensuring the protection of personal information under its control.\n\nTerms of Use: http://ow.ly/10Bk50hMca6\n\nPlease address your questions by email at: information@fintrac-canafe.gc.ca\n\n********\n\nLe Centre d'analyse des opérations et déclarations financières du Canada (CANAFE) est l'unité du renseignement financier et le superviseur en matière de lutte contre le blanchiment d’argent et de financement des activités terroristes du Canada. Son mandat est de faciliter la détection, la prévention et la dissuasion du blanchiment d'argent et du financement des activités terroristes, tout en assurant la protection des renseignements personnels qu'il détient.\n\nNotre protocole d'utilisation: http://ow.ly/lHXM50hMcax\n\nVeuillez adresser vos questions par courriel à l’adresse suivante : information@fintrac-canafe.gc.ca",
    "website": "https://fintrac-canafe.canada.ca/",
    "industry": "Government Administration",
    "company_size": "501-1,000 employees",
    "headquarters": "Ottawa, Ontario"
  },
  {
    "company_slug": "ciro-canadian-investment-regulatory-organization",
    "followers": "24K followers",
    "overview": "L’Organisme canadien de réglementation des investissements (OCRI) est déterminé à protéger les investisseurs, à assurer une réglementation efficace et uniforme et à renforcer la confiance des Canadiens dans la réglementation financière et les personnes qui s’occupent de leurs placements.\n\nThe Canadian Investment Regulatory Organization (CIRO) is committed to the protection of investors, providing efficient and consistent regulation, and building Canadians’ trust in financial regulation and the people managing their investments.",
    "website": "http://www.ciro.ca",
    "industry": "Financial Services",
    "company_size": "201-500 employees",
    "job_openings_text": "CIRO / OCRI has 49 job openings - find the one for you."
  },
  {
    "company_slug": "bank-of-canada",
    "followers": "247K followers",
    "overview": "As Canada’s Central bank, our principal role is to promote the country’s economic and financial welfare by keeping inflation low, stable and predictable. Our vision is to be “a leading central bank—dynamic, engaged and trusted—committed to a better Canada.” No other employer in the country offers you the unique opportunity to work at the very centre of Canada’s economy.",
    "website": "http://www.bankofcanada.ca/careers",
    "industry": "Banking",
    "company_size": "1,001-5,000 employees",
    "headquarters": "Ottawa, Ontario",
    "job_openings_text": "Bank of Canada has 10 job openings - find the one for you."
  },
  {
    "company_slug": "finance-canada",
    "followers": "197K followers",
    "overview": "The Department helps the Government of Canada develop and implement strong and sustainable economic, fiscal, tax, social, security, international and financial sector policies and programs. \n\nThe Department ensures that ministers are supported with high-quality analysis and advice and it plays an important central agency role, working with other departments to ensure that the government's agenda is carried out.\n\nTerms and Conditions: https://www.canada.ca/en/department-finance/corporate/terms-conditions.html  \n__\n\nLe Ministère aide le gouvernement du Canada à élaborer et à mettre en œuvre des politiques et des programmes solides et durables sur les plans économique, fiscal, social, de même qu'en matière de sécurité et dans les secteurs financier et international. \n\nLe Ministère veille à ce que les ministres bénéficient d'analyses et de conseils de grande qualité et joue un rôle important à titre d'organisme central, en collaborant avec d'autres ministères pour veiller à l'exécution du programme du gouvernement.\n\nAvis : https://www.canada.ca/fr/ministere-finances/organisation/avis.html",
    "website": "https://fin.canada.ca",
    "industry": "Government Administration",
    "company_size": "501-1,000 employees",
    "headquarters": "Ottawa, Ontario"
  },
  {
    "company_slug": "canadian-forum-for-financial-markets",
    "followers": "4K followers",
    "overview": "Constructive. Credible. Candid.\nThe CFFiM is instrumental in shaping Canadian legislation and regulation to continuously improve financial markets to benefit investors and improve Canadian living standards. We are a hands-on, pragmatic, energized organization that advocates for smart, workable legislation and regulation based on sound, objective criteria. With courage and integrity, and through intelligent, informed analysis, we advance proposals to demonstrably grow healthy, competitive Canadian financial markets. We are not deterred by challenging issues but encourage the necessary open dialogue to resolve them. We provide an opportunity for government and regulators, as a branch of government, to broaden their considerations. We are a forum for inspirational, informed actionable engagement and debate. Legislative, regulation and policy making for financial markets in Canada would be sleepy without our input.",
    "website": "https://iiac-accvm.ca/",
    "industry": "Financial Services",
    "company_size": "2-10 employees",
    "headquarters": "Toronto, ON"
  },
  {
    "company_slug": "rbc",
    "followers": "854K followers",
    "overview": "Royal Bank of Canada is a global financial institution with a purpose-driven, principles-led approach to delivering leading performance. Our success comes from the 94,000+ employees who leverage their imaginations and insights to bring our vision, values and strategy to life so we can help our clients thrive and communities prosper. As Canada's biggest bank and one of the largest in the world, based on market capitalization, we have a diversified business model with a focus on innovation and providing exceptional experiences to our more than 17 million clients in Canada, the U.S. and 27 other countries. Learn more at rbc.com.\nWe are proud to support a broad range of community initiatives through donations, community investments and employee volunteer activities. See how at www.rbc.com/community-social-impact. \n\nhttp://rbc.com/legalstuff.\n\nLa Banque Royale du Canada est une institution financière mondiale définie par sa raison d'être, guidée par des principes et orientée vers l'excellence en matière de rendement. Notre succès est attribuable aux quelque 94 000+ employés qui mettent à profit leur créativité et leur savoir faire pour concrétiser notre vision, nos valeurs et notre stratégie afin que nous puissions contribuer à la prospérité de nos clients et au dynamisme des collectivités. Selon la capitalisation boursière, nous sommes la plus importante banque du Canada et l'une des plus grandes banques du monde. Nous avons adopté un modèle d'affaires diversifié axé sur l'innovation et l'offre d'expériences exceptionnelles à nos plus de 17 millions de clients au Canada, aux États Unis et dans 27 autres pays. Pour en savoir plus, visitez le site rbc.com/francais \n\nNous sommes fiers d'appuyer une grande diversité d'initiatives communautaires par des dons, des investissements dans la collectivité et le travail bénévole de nos employés. Pour de plus amples renseignements, visitez le site www.rbc.com/collectivite-impact-social.\n\nhttps://www.rbc.com/conditions-dutilisation/",
    "website": "http://www.rbc.com",
    "industry": "Banking",
    "company_size": "10,001+ employees",
    "headquarters": "Toronto, Ontario",
    "job_openings_text": "RBC has 1,554 job openings - find the one for you."
  },
  {
    "company_slug": "cra-arc",
    "followers": "577K followers",
    "overview": "Welcome to the Canada Revenue Agency’s (CRA) official LinkedIn page! 🇨🇦\n\nWe take pride in our diverse workforce, which brings a wide range of skills and perspectives to the Canada Revenue Agency, and remain committed to fostering an inclusive workplace where everyone can thrive. We’re on a mission to better serve Canadians, with the goal to be trusted, fair, and helpful by putting people first. Our dedication has earned us recognition as one of Canada's Top Employers for Young People, Canada’s Best Diversity Employers and National Capital Region’s Top Employer. \n\nFollow us for more on job opportunities, important information about benefits, credits, and all things taxes. \n\nTerms and Conditions: http://ow.ly/XpI030iPAP9\n\nBienvenue sur la page LinkedIn officielle de l’Agence! 🇨🇦\n\nÀ l’Agence du revenu du Canada, nous sommes fiers de la diversité de notre effectif, qui possède un large éventail de compétences et de perspectives. Nous nous engageons à créer un milieu de travail inclusif où chacun peut s’épanouir. Notre mission est de mieux servir la population canadienne en étant dignes de confiance, justes et au service des gens d’abord. Grâce à notre dévouement, nous avons été reconnus comme l’un des meilleurs employeurs pour les jeunes au Canada, l’un des meilleurs employeurs du Canada pour la diversité et le meilleur employeur de la région de la capitale nationale.\n\nTermes et conditions : https://www.canada.ca/fr/agence-revenu/organisation/soyez-branche/interagir-medias-sociaux.html",
    "website": "http://canada.ca/taxes",
    "industry": "Government Administration",
    "company_size": "10,001+ employees"
  },
  {
    "company_slug": "government-of-canada",
    "followers": "944K followers",
    "overview": "The Government of Canada works on behalf of Canadians, both at home and abroad. Visit www.Canada.ca to learn more. \n\nCanada’s professional, non-partisan public service is among the best in the world, and many of its departments and agencies place in Canada’s Top 100 Employers year after year. If you are interested in joining our diverse and innovative team, visit www.jobs.gc.ca for information and opportunities.\n\nTerms: https://www.canada.ca/en/transparency/terms.html\n\n\nLe gouvernement du Canada œuvre au nom des Canadiens, tant au pays qu’à l’étranger. Consultez le site www.canada.ca pour en savoir plus. \n\nImpartiale et professionnelle, la fonction publique du Canada fait partie de l’élite mondiale. Bon nombre de ses ministères et organismes figurent parmi les 100 meilleurs employeurs du pays année après année. Vous aimeriez intégrer notre équipe diversifiée et innovante? Rendez-vous au www.emplois.gc.ca pour obtenir des informations et connaître les possibilités qui s’offrent à vous.\n\nAvis : https://www.canada.ca/fr/transparence/avis.html",
    "website": "http://canada.ca",
    "industry": "Government Administration",
    "company_size": "10,001+ employees",
    "job_openings_text": "Government of Canada has 1,643 job openings - find the one for you."
  },
  {
    "company_slug": "designed-wealth-management",
    "followers": "7K followers",
    "overview": "Design. The process of creating a financial plan or investment portfolio. Designed. Planned for a specific purpose. Transparent and unique. Creating the optimum advisor experience for advisors and their clients. \n\nWe are focused on ensuring advisors can serve their clients without conflicting goals and pressures. We work closely with advisors and portfolio managers to address their top priorities in serving their clients’ needs and provide meaningful insights into practice management. We are designed to support an advisors’ growing practice to help them provide the best advice and service to their clients. With strong core values, and committed staff, we seek excellence in serving the Canadian marketplace.",
    "website": "https://www.designedwealthmanagement.ca/",
    "industry": "Financial Services",
    "company_size": "11-50 employees",
    "headquarters": "Toronto, Ontario",
    "job_openings_text": "Designed Wealth Management has 1 job opening - find the one for you."
  },
  {
    "company_slug": "inclusive-advisory",
    "followers": "734 followers",
    "overview": "We believe that experts in personal and business growth work better when they’re together in one space. We’re a team of accountants, lawyers, investment advisors and human resources consultants collaborating for an innovative approach to financial advisory. It’s Inclusive. Better together.",
    "website": "http://www.inclusiveadvisory.ca",
    "industry": "Accounting",
    "company_size": "11-50 employees",
    "headquarters": "Peterborough, Ontario"
  },
  {
    "company_slug": "cibc",
    "followers": "588K followers",
    "overview": "CIBC is here to help all our clients reach their goals.  \n\nWe know the importance of reliable financial products and services, and we’re dedicated to providing them in a way that lets you bank however you want, whenever you want. \n\nWith innovative tools designed around your priorities and a team fully focused on your success, you’ll get the insights you need to get even closer to achieving your goals. \n\nThis culture of innovation and shared values of trust, teamwork and accountability are why we’ve been named a top employer in Canada. They’re also why a career at CIBC is more than a job—it’s an opportunity to grow and work alongside some of the brightest in Canada.  \n\nLa Banque CIBC est là pour aider tous nos clients à atteindre leurs objectifs. \n\nNous connaissons l'importance de produits et services financiers fiables, et nous nous engageons à les fournir d'une manière qui vous permette d'effectuer vos opérations bancaires comme vous le souhaitez, quand vous le souhaitez. \n\nAvec des outils innovants conçus autour de vos priorités et une équipe entièrement centrée sur votre réussite, vous obtiendrez les informations dont vous avez besoin pour vous rapprocher encore plus de vos objectifs. \n\nCette culture de l'innovation et les valeurs partagées de confiance, de travail d'équipe et de responsabilité sont la raison pour laquelle nous avons été nommés l'un des meilleurs employeurs au Canada. C'est aussi pourquoi une carrière à la Banque CIBC est plus qu'un emploi : c'est une occasion de grandir et de travailler aux côtés de certaines des personnes plus brillantes au Canada.",
    "website": "http://www.cibc.com",
    "industry": "Banking",
    "company_size": "10,001+ employees",
    "headquarters": "Toronto, Ontario",
    "job_openings_text": "CIBC has 618 job openings - find the one for you."
  },
  {
    "company_slug": "td",
    "followers": "947K followers",
    "overview": "The Toronto-Dominion Bank & its subsidiaries are collectively known as TD Bank Group (TD). TD is the sixth largest bank in North America by assets & serves approx. 28 million customers in a number of locations in key financial centres around the globe. With over 95,000 employees, TD ranks among the world's leading online financial firms, with more than 17 million active online and mobile customers. Delivering legendary customer experiences is who we are & is part of our goal to be the Better Bank. Visit our Careers page to learn more about TD & why TD is a great place to work.",
    "website": "https://careers.td.com/",
    "industry": "Banking",
    "company_size": "10,001+ employees",
    "headquarters": "Toronto, Ontario",
    "job_openings_text": "TD has 2,410 job openings - find the one for you."
  },
  {
    "company_slug": "scotiabank",
    "followers": "1M followers",
    "overview": "Welcome to Scotiabank. We serve thousands of customers, families, and communities across the globe, helping them achieve success through advice, products, and services. Follow for news, insights, thought leadership and more.\n\nOur disclaimer: bit.ly/socialdisclaim",
    "website": "http://www.scotiabank.com",
    "industry": "Banking",
    "company_size": "10,001+ employees",
    "headquarters": "Toronto, Ontario",
    "job_openings_text": "Scotiabank has 1,319 job openings - find the one for you."
  },
  {
    "company_slug": "citizenship-and-immigration-canada",
    "followers": "813K followers",
    "overview": "Immigration, Refugees and Citizenship Canada (IRCC) facilitates the arrival of immigrants, provides protection to refugees, and offers programming to help newcomers settle in Canada. It also: grants citizenship, issues travel documents (such as passports) to Canadians; and promotes multiculturalism.\n\nOur social media guidelines: https://www.canada.ca/en/immigration-refugees-citizenship/corporate/terms-conditions.html#social\n-----------\nImmigration, réfugiés et citoyenneté Canada (IRCC) facilite la venue des nouveaux immigrants, fournit de la protection aux réfugiés et, par ses programmes, aide les nouveaux arrivants à s’établir au Canada. Il est également responsable : d’octroyer la citoyenneté; de délivrer des documents de voyage (comme des passeports) aux Canadiens; de promouvoir le multiculturalisme.\n\nNos lignes directrices pour l'utilisation des médias sociaux :\nhttps://www.canada.ca/fr/immigration-refugies-citoyennete/organisation/avis.html#sociaux",
    "website": "http://www.canada.ca/immigration",
    "industry": "Government Administration",
    "company_size": "10,001+ employees"
  },
  {
    "company_slug": "service-canada",
    "followers": "443K followers",
    "overview": "Nous sommes fiers d’être l’endroit où vont les Canadiens – que ce soit en ligne, par téléphone ou en personne – pour accéder aux programmes, aux services et aux prestations dont ils ont besoin du gouvernement du Canada et de ses nombreux partenaires.  \n\nAvis : http://ow.ly/pF0X3090tEp \n\n*******\n\nWe are proud to be the place where Canadians go—whether online, by phone or in person—to access the programs, services and benefits they need from the Government of Canada and its many partners.  \n\nTerms and conditions: http://ow.ly/WNKZ3090pg3",
    "website": "https://www.canada.ca/en/employment-social-development/corporate/portfolio/service-canada.html",
    "industry": "Government Administration",
    "company_size": "10,001+ employees"
  },
  {
    "company_slug": "public-service-commission-of-canada",
    "followers": "19K followers",
    "overview": "La Commission de la fonction publique (CFP) est chargée de promouvoir et de maintenir, en collaboration avec ses partenaires, une fonction publique non partisane, fondée sur le mérite et représentative, au service de tous les Canadiens. Elle gère aussi les outils de recrutement de la fonction publique afin d'offrir aux postulants et aux gestionnaires un portail unique donnant accès à toutes les possibilités d'emploi dans la fonction publique.\n\nLa CFP fait partie du portefeuille de Affaires intergouvernementales et du Nord et du Commerce intérieur et relève directement du Parlement quant à son mandat en tant qu'organisme indépendant.\n\nAvis: http://ow.ly/AdVP309cUZA \n\n***\n\nThe Public Service Commission (PSC) is responsible for promoting and safeguarding a merit-based, representative and non-partisan public service that serves all Canadians, in collaboration with its stakeholders. It also manages the tools for public service recruitment, providing applicants and managers with a single portal to access all public service job opportunities.\n\nThe PSC is a federal institution that is part of the Intergovernmental Affairs, Northern Affairs and Internal Trade portfolio and it reports independently to Parliament on its mandate.\n\nTerms of use: http://ow.ly/vWER309cUB0",
    "website": "https://www.canada.ca/fr/commission-fonction-publique.html",
    "industry": "Government Administration",
    "company_size": "501-1,000 employees",
    "headquarters": "Gatineau, Quebec"
  },
  {
    "company_slug": "statcan",
    "followers": "411K followers",
    "overview": "We are Statistics Canada! We produce relevant, accurate and timely statistics that help Canadians better understand their country. Download our mobile app. to stay on top of the country’s latest statistical news or tune into to our Eh Sayers podcast series to meet the people behind the data and explore the stories behind the numbers.\n\n- Careers at Statistics Canada: statcan.gc.ca/en/employment \n- StatsCAN mobile app: statcan.gc.ca/en/sc/mobile-applications\n- Eh Sayers podcast: statcan.gc.ca/en/sc/podcasts\n- Terms of Use: statcan.gc.ca/eng/sc/terms \n\n---\n\nNous sommes Statistique Canada! Nous produisons des statistiques pertinentes, précises et actuelles qui aident les Canadiens à mieux comprendre leur pays. Téléchargez notre appli. StatsCAN dès aujourd’hui et restez au fait des dernières nouvelles statistiques du pays, ou soyez à l’écoute de notre balado Hé-coutez bien! pour faire la connaissance des personnes derrière les données et découvrir les histoires qu’elles révèlent.\n\nCarrières à Statistique Canada : statcan.gc.ca/fr/emploi \nApplication mobile StatsCAN : statcan.gc.ca/fr/rb/applications-mobiles\nBalado Hé-coutez bien! : statcan.gc.ca/fr/rb/balados\nConditions d’utilisation : statcan.gc.ca/fra/rb/conditions",
    "website": "http://www.statcan.gc.ca",
    "industry": "Government Administration",
    "company_size": "5,001-10,000 employees",
    "headquarters": "Ottawa, Ontario"
  },
  {
    "company_slug": "doing-business-with-the-government-of-canada-faire-affaire-avec-le-gouvernement-du-canada",
    "followers": "17K followers",
    "overview": "Tools to help businesses sell to the Government of Canada. \n\nTerms of use: https://www.canada.ca/en/transparency/terms.html#interact-with\n\n---\n\nOutils pour aider les entreprises à faire affaire avec le gouvernement du Canada.\n\nConditions d'utilisation : https://www.canada.ca/fr/transparence/avis.html#echanger",
    "website": "https://buyandsell.gc.ca/",
    "industry": "Government Administration",
    "company_size": "10,001+ employees",
    "headquarters": "Gatineau, Quebec"
  },
  {
    "company_slug": "aligned-capital-partners-inc-",
    "followers": "",
    "overview": "",
    "website": "",
    "industry": "",
    "company_size": "",
    "headquarters": "",
    "job_openings_text": "Aligned Capital Partners Inc. has 1 job opening - find the one for you."
  },
  {
    "company_slug": "cibc-commercial-banking",
    "followers": "21K followers",
    "overview": "At CIBC Commercial Banking, we help our clients create end-to-end financial solutions to address every business need at each stage of a company's development and operation. Our comprehensive approach helps companies finance growth, manage cash flow, increase efficiency and mitigate risk.\n\nÀ Groupe Entreprises CIBC, nous aidons nos clients à créer des solutions financières de bout en bout afin de combler tous les besoins d’une entreprise à tous les stades de son développement et de son exploitation. Notre approche globale permet aux sociétés de financer leur croissance, de gérer leurs flux de trésorerie, d’accroître leur efficacité et d’atténuer le risque.",
    "website": "https://www.cibc.com/en/commercial.html",
    "industry": "Financial Services",
    "company_size": "10,001+ employees",
    "headquarters": "Toronto, Ontario"
  },
  {
    "company_slug": "cibcbusinessbanking",
    "followers": "16K followers",
    "overview": "The rules of business have changed, our commitment hasn’t. Find a way forward with expert advice, support & solutions. \n\nLe monde des affaires a changé, mais notre engagement demeure le même. Allez de l’avant grâce à des conseils d’experts, des solutions et du soutien.",
    "website": "http://www.cibc.com/business",
    "industry": "Banking",
    "company_size": "10,001+ employees",
    "headquarters": "Toronto, Ontario"
  },
  {
    "company_slug": "cibc-private-wealth-management",
    "followers": "21K followers",
    "overview": "You have unique challenges and ambitions. We can help you address these with our tailored services and solutions. At CIBC Private Wealth, we take a comprehensive approach to managing, building and protecting your wealth. Together we develop a plan that takes into account who you are today and what you want for your family and wealth tomorrow.\n\nCIBC Private Wealth offers customized support and advice to help achieve your wealth goals, including private banking, investment advice and management as well as trust services. \n\nOur integrated approach is built around four key pillars. It all starts with understanding you, your goals and your values, which are supported by our customized services and expert guidance that keeps you moving forward.\n\nOur services are delivered by professionals with our specialized business groups who collaborate to help you meet all of your personal, family and business financial needs.\n\n\n\n\nVous avez des défis et des ambitions uniques. Nous pouvons vous aider à y répondre grâce à nos services et solutions sur mesure. À Gestion privée CIBC, nous adoptons une approche globale en vue de gérer, de faire croître et de préserver votre patrimoine. Ensemble, nous établissons un plan qui tient compte de votre situation actuelle ainsi que de vos souhaits pour votre famille et votre patrimoine. Notre approche intégrée repose sur quatre principaux piliers. Nous commençons par comprendre qui vous êtes et quels sont vois objectifs et vos valeurs, puis nous vous offrons nos services personnalisés et nos conseils d’experts pour que vous puissiez continuer d’avancer. Nos services sont offerts par une équipe de professionnels issus de nos unités spécialisées qui collaborent en vue de satisfaire vos besoins financiers ainsi que ceux de votre famille et de votre entreprise.",
    "website": "https://www.cibc.com/en/private-wealth.html",
    "industry": "Investment Advice",
    "company_size": "10,001+ employees",
    "headquarters": "Toronto, ON"
  },
  {
    "company_slug": "td-wealth-us",
    "followers": "343 followers",
    "overview": "No matter where you are in life, you are building towards something. You set goals, work towards achieving them, and build on your success, with new goals in mind. You build families, careers, businesses and legacies. You build memories, and you never stop dreaming.\n\nAt TD Wealth, we take the time to understand what you’re focused on today and what you’re aiming to achieve in the future. For clients of TD Investment Services (US) and Private Client Group we can work with you to create a personalized TD Wealth Plan that aligns with your financial goals and aspirations.",
    "website": "https://www.td.com/us/en/investing",
    "industry": "Financial Services",
    "company_size": "10,001+ employees"
  },
  {
    "company_slug": "tdassetmanagement",
    "followers": "62K followers",
    "overview": "TD Asset Management Inc. (\"TDAM\"), a member of TD Bank Group, is a North American investment management firm. TDAM offers investment solutions to corporations, pension funds, endowments, foundations and individual investors. Additionally, TDAM manages assets for millions of retail investors and offers a broadly diversified suite of investment solutions including mutual funds, exchange-traded funds (ETFs), and professionally managed portfolios. TD Asset Management Inc. is a wholly-owned subsidiary of The Toronto-Dominion Bank. Visit us at http://www.tdassetmanagement.com to learn more.\n\nGestion de Placements TD Inc. (« GPTD »), un membre du Groupe Banque TD, est une société de gestion de placements nord-américaine. GPTD offre ses solutions de placement à des entreprises, des caisses de retraite, des fonds de dotation, des fondations et des investisseurs individuels. De plus, GPTD gère des actifs pour le compte de millions de particuliers et offre une gamme très diversifiée de solutions de placement incluant des fonds communs de placement, des fonds négociés en bourse (FNB) et des portefeuilles gérés par des professionnels. Gestion de Placements TD Inc. est une filiale en propriété exclusive de La Banque Toronto-Dominion. Pour en savoir plus, rendez-vous au http://www.tdassetmanagement.com.",
    "website": "http://www.td.com/ca/en/asset-management/",
    "industry": "Financial Services",
    "company_size": "1,001-5,000 employees",
    "headquarters": "Toronto, Ontario"
  },
  {
    "company_slug": "software-development",
    "followers": "6K followers",
    "overview": "A creative software engineers working together to learn, design, code and build digital products for the better world!",
    "website": "https://www.artbees.co.uk/services/software-development",
    "industry": "Information Services",
    "company_size": "51-200 employees",
    "headquarters": "London, England"
  },
  {
    "company_slug": "theapexcurator",
    "followers": "2K followers",
    "overview": "At Apex Curator, we design real-world, role-based eLearning programs that go beyond theory. Whether you’re aiming for your first admin cert or architecting multi-cloud solutions, our content meets you where you are — and takes you further.\n\nWe don’t just teach Salesforce — we curate transformative learning experiences that turn beginners into certified pros, and professionals into platform architects.\n\n🔹 Built by Experts – Courses designed by Salesforce Architects, and real-world consultants.\n🔹 Hands-On Labs – We simulate real org scenarios so you learn by doing.\n🔹 Job-Ready Learning – Everything we teach is designed to close the gap between certification and employability.\n🔹 Always Updated – Salesforce evolves fast — and so do we.\n\nWe proudly serve individuals, teams, and enterprises looking to stay ahead in the Salesforce economy.\n\n🌍 Join our growing global community of Trailblazers, builders, and changemakers.\n📚 Learn smarter. Build faster. Deliver better.\n📈 Because in Salesforce, it's not about what you know — it's about what you can apply.\n\n👉 #Salesforce #eLearning #Trailblazer #AdminToArchitect #ApexCurator",
    "website": "https://payhip.com/theApexCurator",
    "industry": "Technology, Information and Internet",
    "company_size": "2-10 employees"
  },
  {
    "company_slug": "zoho",
    "followers": "2M followers",
    "overview": "Zoho offers beautifully smart software to help you grow your business. With over 100 million users worldwide, Zoho's 55+ products aid your sales and marketing, support and collaboration, finance, and recruitment needs—letting you focus only on your business. Zoho respects user privacy and does not have an ad-revenue model in any part of its business, including its free products. \n \nZoho Corporation is a privately-held and profitable company headquartered in Austin, Texas with international headquarters in Chennai, India, with offices across the globe.",
    "website": "https://www.zoho.com/",
    "industry": "Software Development",
    "company_size": "10,001+ employees",
    "headquarters": "Chennai, Tamil Nadu",
    "job_openings_text": "Zoho has 56 job openings - find the one for you."
  },
  {
    "company_slug": "aubank",
    "followers": "882K followers",
    "overview": "The dream started two decades ago by Mr. Sanjay Agarwal, a merit holder Chartered Accountant and a first generation entrepreneur, along with his proficient team. Together, the dexterous team embarked on a journey of excellence while enriching lives along the way. \n\nWhat started off as a dream to be one of the fastest growing NBFCs, AU Financiers is now AU SMALL FINANCE BANK. Throughout our journey we have focused on solutions, completely based on our customers’ needs. As we grow, we continue to be farsighted, aligning the interest of our community at large.",
    "website": "https://www.aubank.in/",
    "industry": "Banking",
    "company_size": "10,001+ employees",
    "headquarters": "JAIPUR, RAJASTHAN",
    "job_openings_text": "AU SMALL FINANCE BANK has 10 job openings - find the one for you."
  },
  {
    "company_slug": "aditya-birla-capital",
    "followers": "471K followers",
    "overview": "Aditya Birla Capital Ltd is a financial services company based out of One World Center, Tower 1, 18th Floor, Jupiter Mills Compound, 841, Senapati Bapat Marg, Elphinstone Road, MUMBAI, India.\n\n-\nAditya Birla Capital is committed to provide equal opportunity to all in employment and prohibits discrimination or harassment in any form on the basis of race, colour, religion, ethnicity, age, gender, disability or any other characteristic protected by law. Diversity, Equity and Inclusion (DEI) is embedded in our recruitment policies based on our business needs and candidates meeting the eligibility criteria such as qualification, skills and experience.",
    "website": "http://adityabirlacapital.com/careers",
    "industry": "Financial Services",
    "company_size": "10,001+ employees",
    "job_openings_text": "Aditya Birla Capital has 67 job openings - find the one for you."
  },
  {
    "company_slug": "lntfinance",
    "followers": "794K followers",
    "overview": "L&T Finance is one of the leading NBFCs offering a range of loans across Rural | Housing | Two-Wheeler | Personal & Business (SME)\n\nThe company is promoted by Larsen and Toubro Ltd. (L&T), one of the largest conglomerates in India. LTF is publicly listed on both the exchanges of India - BSE & NSE and complies to the guidelines applicable to an NBFC- CIC.\n\nHeadquartered in Mumbai, the company has been rated AAA, the highest credit rating for NBFCs by four leading rating agencies.",
    "website": "http://www.ltfs.com",
    "industry": "Financial Services",
    "company_size": "5,001-10,000 employees",
    "headquarters": "Mumbai, Maharashtra",
    "job_openings_text": "L&T Finance has 2 job openings - find the one for you."
  },
  {
    "company_slug": "wellsfargo",
    "followers": "3M followers",
    "overview": "Wells Fargo & Company (NYSE: WFC) is a diversified, community-based financial services company with approximately $1.9 trillion in assets. Wells Fargo’s vision is to satisfy our customers’ financial needs and help them succeed financially. Founded in 1852 and headquartered in San Francisco, Wells Fargo provides banking, investment and mortgage products and services, as well as consumer and commercial finance, through more than 7,300 locations, 12,000 ATMs, the internet (wellsfargo.com) and mobile banking, and has offices in over 40 countries and territories to support customers who conduct business in the global economy. With approximately 250,000 team members, Wells Fargo serves one in three households in the United States. Wells Fargo & Company was ranked No. 41 on Fortune’s 2022 rankings of America’s largest corporations. News, insights and perspectives from Wells Fargo are also available at Wells Fargo Stories. \n\nRelevant military experience is considered for veterans and transitioning service men and women. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, status as a protected veteran, or any other legally protected characteristic.© 2016 Wells Fargo Bank, N.A. All rights reserved. Member FDIC.",
    "website": "http://www.wellsfargo.com",
    "industry": "Financial Services",
    "company_size": "10,001+ employees",
    "headquarters": "San Francisco, California",
    "job_openings_text": "Wells Fargo has 2,604 job openings - find the one for you."
  },
  {
    "company_slug": "data-analyst-jobsss",
    "followers": "11K followers",
    "industry": "IT Services and IT Consulting",
    "company_size": "2-10 employees"
  },
  {
    "company_slug": "pharmabharat",
    "followers": "80K followers",
    "overview": "Pharmabharat is a leading Clinical Research Organization (CRO) and a dedicated career portal for students and professionals seeking opportunities in various sectors of the healthcare industry. We specialize in providing recruitment solutions for roles in Regulatory Affairs (RA), Pharmacovigilance (PV), Clinical Data Management (CDM), Clinical Research (CR), Regulatory Affairs, SAS, Medical Science Liaison (MSL), Production, Quality Assurance (QA), Quality Control (QC), Research & Development (R&D), Analytical R&D (AR&D), Formulation R&D (FR&D), Scientists, Research Fellowships, and Government Pharmacist positions.\n\nWith a dynamic and passionate team, Pharmabharat has successfully completed over 50 projects, specializing in Oncology and Rare Diseases. Our innovative approach includes a blockchain-enabled, AI-driven patient recruitment platform, tailored for rare diseases, ensuring efficient and secure patient enrollment for clinical trials. Additionally, our Real-Time Trial Performance Dashboard allows for seamless monitoring and management of clinical trial progress. We also offer Post-Trial Patient Support Programs to ensure continuous care and support for patients even after the trial concludes.\n\nAt Pharmabharat, we are committed to advancing clinical research and empowering the next generation of healthcare professionals through opportunities and solutions that bridge the gap between talent and industry needs.",
    "website": "https://pharmabharat.com/",
    "industry": "Biotechnology Research",
    "company_size": "11-50 employees",
    "headquarters": "Mumbai, maharashtra"
  },
  {
    "company_slug": "techvistajob",
    "followers": "80K followers",
    "overview": "At Techvista, we specialize in building Mobile Apps at Scale. We also have experience in web-based platform development, middleware, cloud service integration, and more. Our most popular apps on iOS and Android have millions of downloads and active users worldwide!\n\nOur team pays great attention to detail while building technology solutions, designs scalable and robust architecture to support future growth, and cares deeply about user experience.\n\nWe love working with various industries like healthcare, product companies, digital and marketing agencies, education and e-learning, travel and hospitality, and logistics. We are also a top-rated firm on Upwork.\n\nTechvista is growing fast and hiring for multiple roles. We are currently a fully remote team based in USA and India. Please check out our open positions or talk to us to learn more about some of the exciting projects we are working on.",
    "industry": "IT Services and IT Consulting",
    "company_size": "2-10 employees"
  },
  {
    "company_slug": "microsoft-power-bi-masterclass",
    "followers": "56K followers",
    "overview": "We are a community of authors sharing our Microsoft Power BI experience.\nLearn together. Grow together.",
    "website": "https://linktr.ee/powerbi.masterclass",
    "industry": "Technology, Information and Internet",
    "company_size": "11-50 employees"
  },
  {
    "company_slug": "hirewebk",
    "followers": "12K followers",
    "website": "www.hirewebk.com",
    "industry": "IT Services and IT Consulting",
    "company_size": "11-50 employees"
  },
  {
    "company_slug": "federal-bank",
    "followers": "644K followers",
    "overview": "Federal Bank, one of the leading private sector banks with presence across the country, began its journey from humble backgrounds to reach the stature of an institution with national prominence & character. With a rich legacy of 7 decades, the Bank aspires to be the most admired Bank in the country and fueling its dreams are the 19 million and growing customer base who have always been loyal to the Bank as the Bank is to them. Headquartered in Aluva, Kerala, the Bank’s scrips are widely held and are listed in the Bombay Stock Exchange and National Stock Exchange in India. The Bank’s global depository receipts are listed on the London Stock Exchange. The Bank has built its empire on the twin values of ethics and excellence, and this has propelled the Bank throughout its journey.   \n\nOver 1,588 branches, 2079+ ATMs/ Cash Recyclers and a committed, experienced & energetic workforce, Federal Bank now has its presence across the nation. To service the NRIs, who have been its pillars of strength, the Bank operates Representative Offices at Dubai and Abu Dhabi in the UAE. The Bank today handles one fifth of the total NR remittance to the country and this is testimony to its relationship with the NR diaspora. The Bank also has an IFSC Banking Unit (IBU) in Gujarat International Finance Tec-City (GIFT City).  \nTransformation is inevitable and for Federal Bank it has been no different. The Bank believes in transforming itself, keeping its principles intact, to match the beats of the industry and the expectations of its stakeholders. Technology is the new buzzword, and it has left its indelible mark in the banking industry as well. \n\nDisclaimer: Federal Bank advices against sharing any confidential information on social media handles of the Bank",
    "website": "http://www.federalbank.co.in",
    "industry": "Banking",
    "company_size": "10,001+ employees",
    "headquarters": "Ernakulam, Kerala"
  },
  {
    "company_slug": "hdfc-bank",
    "followers": "3M followers",
    "overview": "HDFC Bank is India's largest private sector bank, offering a comprehensive range of financial products and services to our customer base of over 92 million. Our extensive distribution network of 8,919 branches and 21,031 ATMs across 3,836 cities and towns as of August 2024, reaches every corner of the country, making us accessible to millions.\n\n \n\nPromoted by Housing Development Finance Corporation (HDFC), India's leading housing finance company, HDFC Bank began operations in 1995 with a simple mission: to be a \"World-class Indian Bank\". With a single-minded focus on product leadership, customer focus and operational excellence, we have emerged as a leading player in all our business segments. We cater to individuals and businesses, offering a full range of innovative banking solutions including loans, payments, and wealth management. Our business solutions empower companies of all sizes, from MSMEs to large corporations, helping them grow with tailored banking services and financial tools.\n\n \n\nIn 2023, the Bank merged with HDFC Ltd, combining our robust banking services with HDFC Ltd's legacy of leadership in housing finance. This merger enhances our ability to offer home loans and other financial services, ensuring seamless access for customers across urban and rural areas.\n\n \n\nAs a socially responsible corporate citizen, we believe in banking with a purpose. Through our CSR initiative, Parivartan, we actively work to drive positive change across education, healthcare, skills training, and sustainable livelihoods impacting over 10 crore lives across the country. Our commitment to community impact is as strong as our dedication to delivering value to our stakeholders.\n\n \n\nAs we expand, we continue to stay at the forefront of innovation, offering seamless digital banking experiences to enhance the lives of our customers. HDFC Bank prioritises the security of its systems and remains committed to maintaining the confidentiality of its customers' data. As a precaution",
    "website": "https://www.hdfcbank.com/",
    "industry": "Banking",
    "company_size": "10,001+ employees",
    "headquarters": "Mumbai, Maharashtra",
    "job_openings_text": "HDFC Bank has 15 job openings - find the one for you."
  },
  {
    "company_slug": "indusind-bank",
    "followers": "2M followers",
    "overview": "IndusInd Bank, which commenced operations in 1994, caters to the needs of both consumer and corporate customers. Its technology platform supports multi-channel delivery capabilities. As on March 31, 2022, IndusInd Bank has 2,265 Branches / Banking Outlet and 2,767 ATMs spread across 776 geographical locations of the country. The Bank also has representative offices in London, Dubai and Abu Dhabi. The Bank believes in driving its business through technology. It enjoys clearing bank status for both major stock exchanges - BSE and NSE - and major commodity exchanges in the country, including MCX, NCDEX and NMCE. IndusInd Bank was included in the NIFTY 50 benchmark index on April 1, 2013.",
    "website": "http://www.indusind.com",
    "industry": "Banking",
    "company_size": "10,001+ employees",
    "job_openings_text": "IndusInd Bank has 17 job openings - find the one for you."
  },
  {
    "company_slug": "axis-bank",
    "followers": "3M followers",
    "overview": "Axis Bank is the third largest private sector bank in India. The Bank offers the entire spectrum of financial services to customer segments covering Large and Mid-Corporates, MSME, Agriculture and Retail Businesses.\n\nThe Bank has a large footprint of 5000 domestic branches (including extension counters) with 15,751 ATMs & cash recyclers spread across the country. The Bank has 6 Axis Virtual Centres with over 1,500 Virtual Relationship Managers as on 31st March 2023. The Overseas operations of the Bank are spread over eight international offices with branches in Singapore, Dubai (at DIFC), and Gift City-IBU; representative offices in Dhaka, Dubai, Abu Dhabi, Sharjah and an overseas subsidiary in London, UK. The international offices focus on Corporate Lending, Coverage Business, Trade Finance, Syndication, Investment Banking, Liability Businesses, and Private Banking/Wealth Management offerings.\n\nAxis Bank is one of the first new generation private sector banks to have begun operations in 1994. The Bank was promoted in 1993, jointly by Specified Undertaking of Unit Trust of India (SUUTI) (then known as Unit Trust of India), Life Insurance Corporation of India (LIC), General Insurance Corporation of India (GIC), National Insurance Company Ltd. (NIC), The New India Assurance Company Ltd. (NIA), The Oriental Insurance Company Ltd. (OIC), and United India Insurance Company Ltd. (UIIC). The shareholding of Unit Trust of India was subsequently transferred to SUUTI, an entity established in 2003. GIC, NIC, NIA, OIC, UIIC have been reclassified from promoter category to public category. As on March 31, 2023, SUUTI and LIC are the promoters of the Bank.\n\nWith a balance sheet size of Rs. 13,17,326 crores as on 31st March 2023, Axis Bank has achieved consistent growth and with a 5-year CAGR (2017-18 to 2022-23) of 14% each in Total Assets & Advances and 16% in Deposits.",
    "website": "http://www.axisbank.com",
    "industry": "Banking",
    "company_size": "10,001+ employees",
    "headquarters": "Mumbai, Maharashtra",
    "job_openings_text": "Axis Bank has 18 job openings - find the one for you."
  },
  {
    "company_slug": "ujjivanbank",
    "followers": "666K followers",
    "overview": "Ujjivan Small Finance Bank Limited is a banking company licensed under Section 22 (1) of the Banking Regulation Act, 1949 to carry on small finance bank business. It is also a subsidiary of Ujjivan Financial Services Ltd. The bank has commenced its operations with effect from February 1, 2017 & we attained a Scheduled Bank status in August 2017.     \n\nCurrently, Ujjivan Small Finance Bank has 752 branches live across 26 States and Union Territories. Ujjivan’s mission is to build a leading state of the art “mass market” bank in five years serving the unserved and underserved customers who are currently outside the formal banking system.        \n\nKnow more about social media privacy policy @ https://ujjivansfb.in/privacy-policy.html",
    "website": "https://www.ujjivansfb.in",
    "industry": "Banking",
    "company_size": "10,001+ employees",
    "headquarters": "Bengaluru, Karnataka",
    "job_openings_text": "Ujjivan Small Finance Bank has 13 job openings - find the one for you."
  },
  {
    "company_slug": "hr-hinas",
    "followers": "14K followers",
    "website": "www.hina.com",
    "industry": "IT Services and IT Consulting",
    "company_size": "11-50 employees"
  },
  {
    "company_slug": "ravina-p-hr",
    "followers": "7K followers",
    "industry": "IT Services and IT Consulting",
    "company_size": "2-10 employees"
  },
  {
    "company_slug": "hr-vaishali-khots",
    "followers": "13K followers",
    "website": "www.vaishali.com",
    "industry": "IT Services and IT Consulting",
    "company_size": "11-50 employees"
  },
  {
    "company_slug": "hr-ashwini-karkiis",
    "followers": "9K followers",
    "website": "www.ashwini.com",
    "industry": "IT Services and IT Consulting",
    "company_size": "11-50 employees"
  },
  {
    "company_slug": "datasciencereality",
    "followers": "172K followers",
    "overview": "Data science reality, is a ground based organisation that is dedicated to providing free resources and information for those interested in learning about data science. \n\nOur aim is to make data science education accessible to everyone, regardless of their background or skill level. Our team of experienced data scientists and engineers have created a wide range of resources, including courses, tutorials, and articles, that cover the latest techniques in machine learning, artificial intelligence, and big data.\n\nWe understand that learning data science can be challenging, which is why we also offer a community forum and resources to support our students throughout their journey. Our community is a place where students can connect with their peers, ask questions, and share their experiences.\n\nWe believe that data science has the power to change the world, and we are committed to helping as many people as possible learn about this exciting field. Whether you're a student, a professional looking to upskill, or simply someone who is curious about data science, we invite you to explore our resources and join our community. Together, we can make data science education accessible to all.",
    "industry": "IT Services and IT Consulting",
    "company_size": "0-1 employees"
  },
  {
    "company_slug": "mw-groups",
    "followers": "8K followers",
    "website": "www.mwgroup.com",
    "industry": "IT Services and IT Consulting",
    "company_size": "11-50 employees"
  },
  {
    "company_slug": "qebfitech-solution",
    "followers": "22K followers",
    "website": "www.qebfitech.in",
    "industry": "IT Services and IT Consulting",
    "company_size": "51-200 employees"
  },
  {
    "company_slug": "tata-capital",
    "followers": "994K followers",
    "overview": "Tata Capital Limited is a subsidiary of Tata Sons Limited. The Company is registered with the Reserve Bank of India as a Core Investment Company and offers through itself and its subsidiaries fund and fee-based financial services to its customers, under the Tata Capital brand.\nAs a trusted and customer-centric, one-stop financial services provider, Tata Capital caters to the diverse needs of retail, corporate and institutional customers, across various areas of business namely the Commercial Finance, Infrastructure Finance, Cleantech Finance, Wealth Management, Consumer Loans and distribution and marketing of Tata Cards. Tata Capital has over 500+ branches spanning all critical markets in India.",
    "website": "http://www.tatacapital.com",
    "industry": "Financial Services",
    "company_size": "5,001-10,000 employees",
    "headquarters": "Mumbai, Maharashtra"
  },
  {
    "company_slug": "informationtechnology",
    "followers": "13K followers",
    "overview": "Information technology refers to anything related to computing technology. The Internet, for example, comes under the umbrella term IT. So does computer hardware, software, and networking.\nHere, you can find anything related to Technology, Engineering, Manufacturing, and Innovation.",
    "industry": "IT Services and IT Consulting",
    "company_size": "501-1,000 employees",
    "headquarters": "Silicon Valley, CA"
  },
  {
    "company_slug": "digitechsquad",
    "followers": "2K followers",
    "overview": "DigiTech Squad Pvt Ltd | Empowering Businesses Through Smarter IT Solutions\n\nDigiTech Squad Pvt Ltd is a trusted global IT service provider delivering innovative, reliable, and scalable technology solutions to businesses across all industries.\n\nWe partner with the world’s leading technology vendors and leverage strong industry relationships to bring unmatched value to our clients. Backed by certified professionals and years of proven expertise, our mission is simple—help you get the maximum return on your technology investments.\n\nOur clients enjoy true 24/7 support, access to our deep technical knowledge, and a track record of delivering results that drive efficiency, security, and growth.\n\n💡 Core Competencies & Services\n\n1️⃣ Comprehensive IT Managed Services & Strategic Outsourcing\n2️⃣ End-to-End Hardware Procurement\n3️⃣ Meeting Room & Collaboration Space Installations\n4️⃣ Advanced Audiovisual (AV) Integration\n5️⃣ Secure & Scalable Remote Work Solutions\n6️⃣ 24/7 IT Support & Service Desk Operations\n7️⃣ Microsoft Licensing, Cloud Migrations & Platform Management\n8️⃣ Fully Managed Security Operations Center (SOC) – 24/7 Monitoring\n9️⃣ Fully Managed Network Operations Center (NOC) – 24/7 Monitoring\n🔟 Global IT Smart Hands & Onsite Technical Support\n1️⃣1️⃣ Data Protection, Compliance & Information Lifecycle Management\n1️⃣2️⃣ Cybersecurity & Disaster Recovery Planning\n1️⃣3️⃣ Comprehensive Vulnerability Assessments & Threat Analysis\n1️⃣4️⃣ Automated Patch Management & Compliance Reporting\n1️⃣5️⃣ Device-as-a-Service (DaaS) Solutions\n1️⃣6️⃣ Professional Penetration Testing & Risk Assessment\n\n🌍 Why DigiTech Squad?\n✔ Global Reach with Local Expertise\n✔ Vendor-Certified & Highly Trained Technicians\n✔ Round-the-Clock Monitoring & Support\n✔ Proven Track Record in Service Excellence\n\n📩 Get in Touch:\n🌐 www.digitechsquad.com\n✉ info@digitechsquad.com",
    "website": "https://www.digitechsquad.com/",
    "industry": "IT Services and IT Consulting",
    "company_size": "51-200 employees",
    "headquarters": "Fort Lauderdale, Florida"
  },
  {
    "company_slug": "hackerrank",
    "followers": "2M followers",
    "overview": "HackerRank is a technology hiring platform that is the standard for assessing developer skills for 2500+ companies around the world. HackerRank helps companies hire skilled developers and innovate faster by enabling tech recruiters and hiring managers to objectively evaluate talent at every stage of the recruiting process.",
    "website": "https://www.hackerrank.com/",
    "industry": "Software Development",
    "company_size": "201-500 employees",
    "headquarters": "Cupertino, California",
    "job_openings_text": "HackerRank has 18 job openings - find the one for you."
  },
  {
    "company_slug": "cringe-patrol",
    "followers": "2K followers",
    "overview": "In difesa del buon senso digitale: aiutiamo LinkedIn a tornare business, non burlesque, interveniamo dove il clickbait incontra l’esibizionismo, monitoriamo l’engagement più estremo.\nProteggi la tua timeline da #cringe e contenuti da show da salotto. \nPerché su un social professionale, la sostanza vince sempre sul bordo.",
    "industry": "Entertainment Providers",
    "company_size": "2-10 employees"
  },
  {
    "company_slug": "sonu-kumar-hr",
    "followers": "2K followers",
    "industry": "IT Services and IT Consulting",
    "company_size": "11-50 employees"
  },
  {
    "company_slug": "sde-jobs-and-internships",
    "followers": "104K followers",
    "overview": "Welcome to our Tech Hiring LinkedIn page! We're a passionate team dedicated to sourcing and onboarding top-tier tech talent. With a finger on the pulse of industry trends, we craft innovative recruitment strategies that connect companies with the brightest minds. Our collaborative environment empowers you to thrive professionally while maintaining a fulfilling work-life balance. As a member of our team, you'll drive the digital transformation by bringing in diverse perspectives and expertise. Join us in shaping the future of technology, where your skills and ideas intersect with unparalleled opportunities for growth, learning, and making a lasting impact.\n\nFor promotions & collaboration Email us - \nsdejobsandinternships@gmail.com",
    "website": "https://t.me/SDEjobsandinternships",
    "industry": "Software Development",
    "company_size": "0-1 employees",
    "headquarters": "Karnataka, Bangalore"
  },
  {
    "company_slug": "adsrole",
    "followers": "7K followers",
    "overview": "AdsRole- Top Digital Marketing Company is an emerging website solution provider that helps make your ordinary website look spectacular. The digital market is an ever-growing platform and a pivotal part of every business today. Therefore, it is imperative for any organization venturing into the online marketplace to keep an eye out for the digital changes, and up with the pace. \n\nAdsRole helps you stay ahead of the competition. We help your business gain online visibility by advertising your brand in the best possible manner through effective marketing and publicity of your website at an affordable price. As a result, you enjoy higher conversion rates, profits, and revenues.\n\nAdsRole helps you reach your destination sooner and with confidence! Whether it’s about getting your website designed and developed, improving its visibility through Search Engine Optimisation (SEO), Social Media and Pay Per Click (PPC), or maintaining the website, we have got you covered. All your website-related concerns starting from the preliminary to later stages can be tackled here.",
    "website": "https://www.adsrole.com",
    "industry": "Technology, Information and Internet",
    "company_size": "501-1,000 employees",
    "headquarters": "Noida, Uttar Pradesh"
  },
  {
    "company_slug": "amdox-technologies",
    "followers": "2K followers",
    "overview": "Amdox Technologies is a forward-thinking software development company dedicated to delivering cutting-edge digital solutions for startups, enterprises, and everything in between. We specialize in building scalable, secure, and high-performance applications tailored to meet modern business demands.\n\nFrom idea to execution, we bring innovation to life through our expertise in web development, mobile apps, custom software, cloud solutions, and product engineering. Whether you're looking to automate processes, launch a new platform, or scale your digital footprint — we've got you covered.\n\nWhat We Do?\n🔹 Custom Software Development\n🔹 Web & Mobile Application Development\n🔹 Enterprise Solutions & SaaS Products\n🔹 Cloud Integration & DevOps\n🔹 UI/UX Design & Prototyping\n🔹 IT Consulting & Technical Support\n\nWhy Choose Amdox?\n✅ Agile & Transparent Development Process\n✅ Skilled Tech Talent & Passionate Innovators\n✅ Client-Centric Approach\n✅ On-Time Delivery & Scalable Architecture\n✅ Long-Term Tech Partnerships\n\nAt Amdox Technologies, we're not just building software — we're building solutions that transform businesses.",
    "website": "https://amdox.in/",
    "industry": "Software Development",
    "company_size": "51-200 employees",
    "headquarters": "Bengaluru, karnataka"
  },
  {
    "company_slug": "unstop",
    "followers": "173K followers",
    "overview": "Imagine saving time & resources to hire talent while assessing them and branding yourself. At Unstop, we've made it all possible for 1000+ companies and counting. \nExplore our digital playground of opportunities where 25,000,000+ students and early talent are ready to be discovered, engaged and hired while we build a robust brand strategy for you. \n\nTrust us to help you find the right candidate through competitions utilising our AI-enabled proctored tools that ensure unbiased results. \nWhat's more? We are creating an impactful community that is learning, practising, getting mentored and is ready to start their career journey with you.\n\nThis is the true essence of Unstop. \nUnstop. A digital playground, where talent meets opportunities.",
    "website": "unstop.com?utm_source=linkedin&utm_medium=social&ref=social",
    "industry": "Technology, Information and Internet",
    "company_size": "51-200 employees",
    "headquarters": "New Delhi, Delhi",
    "job_openings_text": "Unstop has 4 job openings - find the one for you."
  },
  {
    "company_slug": "resume-mate",
    "followers": "48K followers",
    "overview": "Custom Software development. we develop softwares for different industries including recruitment",
    "website": "https://www.resumemate.io/",
    "industry": "Software Development",
    "company_size": "2-10 employees",
    "headquarters": "Banglore, Karnataka"
  },
  {
    "company_slug": "brainx-solution",
    "followers": "2K followers",
    "industry": "IT Services and IT Consulting",
    "company_size": "51-200 employees"
  },
  {
    "company_slug": "zignuts-technolab",
    "followers": "14K followers",
    "overview": "At Zignuts, we turn visionary ideas into tangible digital realities. As a premier software development and consulting agency, our mission is to empower businesses with cutting-edge technology solutions. We specialize in web and mobile app development, enterprise solutions, and AI driven digital transformation, ensuring that our clients stay ahead in a rapidly evolving digital landscape.\n\nOur global team of experts is dedicated to delivering high-quality, scalable, and cost-effective solutions tailored to meet the unique needs of each client. We pride ourselves on our ability to combine creativity, technology, and commitment to excellence, providing top-tier services that drive business growth and innovation.\n\nAt Zignuts, we believe in fostering strong partnerships, continuous learning, and adopting the best practices in the industry. Our focus on enhancing skills, delivering value, improving operational practices, and establishing robust processes ensures that we deliver results that match international standards.\n\nEstablished in 2012, we have worked with various organizations, from startups to enterprises including Fortune 500 and publicly listed companies. We have helped many successful startups to ideate, build and scale their products with our focused engineering mindset, skills and our passion to deliver robust and scalable solutions.\n\nJoin us on our journey to transform your business with innovative digital solutions and exceptional service. Together, we can build the future of technology.\n\nWebsite: www.zignuts.com\nBlog: www.zignuts.com/blogs\nCase Studies: www.zignuts.com/case-studies\n\nContact: hello@zignuts.com",
    "website": "http://www.zignuts.com/",
    "industry": "Software Development",
    "company_size": "201-500 employees",
    "headquarters": "Berlin, Berlin"
  },
  {
    "company_slug": "fullremoteit",
    "followers": "1K followers",
    "overview": "Ricevi gratis, ogni mercoledì, una newsletter con le migliori offerte di lavoro fullremote per sviluppatori, QA, data scientist, designer, PM, engineering manager e tanti altri ruoli!",
    "website": "https://fullremote.it",
    "industry": "Technology, Information and Internet",
    "company_size": "0-1 employees"
  },
  {
    "company_slug": "institut-de-chimie-s%C3%A9parative-de-marcoule",
    "followers": "1K followers",
    "overview": "Created in January 2007, the Marcoule Institute for Separation Chemistry (ICSM) is a Joint Research Unit (UMR 5257) involving the French Alternative Energies and Atomic Energy Commission (CEA), the National Center for Scientific Research (CNRS), the University of Montpellier (UM), and the National Graduate School of Chemistry of Montpellier (ENSCM).\nAs part of the Pôle de Chimie from the University of Montpellier and the Institut des Sciences et Technologies pour une Economie circulaire des énergies bas Carbone (ISEC) within the CEA Energy Division (CEA/DES), ICSM aims to conduct fundamental research with the primary objective of \"offering options\" for the development of separation chemistry processes applied to the field of decarbonized energy. This research integrates the challenges of sustainable nuclear energy and the demands of the circular economy.",
    "website": "https://www.icsm.fr",
    "industry": "Research Services",
    "company_size": "51-200 employees"
  },
  {
    "company_slug": "hr-ashwini-karkiiis",
    "followers": "7K followers",
    "website": "www.ashwini.co",
    "industry": "IT Services and IT Consulting",
    "company_size": "11-50 employees"
  },
  {
    "company_slug": "apexcifytechnologys",
    "followers": "1K followers",
    "overview": "Welcome to Apexcify Technologys: Empowering Your Career Journey\nAt Apexcify Technologies, we are dedicated to bridging the gap between academic knowledge and industry requirements. Our mission is to provide a platform for aspiring professionals to gain practical experience, develop their skills, and launch their careers in the tech industry. We believe that every individual has the potential to excel in their chosen field, and we are committed to guiding them every step of the way.\nOur Vision\nOur vision is to become a leading provider of internships and job opportunities in the tech industry. We aim to create a community of talented and motivated individuals who are passionate about innovation and excellence. By providing a supportive and nurturing environment, we empower our interns to develop their skills, build their confidence, and achieve their career goals.\n\nOur Mission\n\nOur mission is to provide high-quality internships and job opportunities that equip individuals with the skills and experience needed to succeed in the tech industry. We are committed to:\n- Providing a platform for individuals to gain practical experience and develop their skills\n- Offering guidance and mentorship to help interns achieve their career goals\n- Fostering a culture of innovation, excellence, and teamwork\n- Building strong relationships with industry partners to provide job opportunities\n- Recognizing and rewarding outstanding performance and achievement\nOur Internship Program\nOur internship program is designed to provide individuals with hands-on experience in their chosen field. We offer internships in a variety of areas, including software development, data science, marketing, and more. Our interns work on real-world projects, collaborate with experienced professionals, and develop valuable skills that are highly sought after by employers.",
    "industry": "IT Services and IT Consulting",
    "company_size": "201-500 employees"
  },
  {
    "company_slug": "hr-rita",
    "followers": "10K followers",
    "website": "www.rita.com",
    "industry": "IT Services and IT Consulting",
    "company_size": "11-50 employees"
  },
  {
    "company_slug": "rutuja-m-hr",
    "followers": "9K followers",
    "website": "www.rutija.com",
    "industry": "IT Services and IT Consulting",
    "company_size": "11-50 employees"
  },
  {
    "company_slug": "ss-infotech-co",
    "followers": "1K followers",
    "overview": "SS Infotech, we’re your one-step solution for all things tech! 🚀 We specialize in delivering cutting-edge solutions across a range of domains, empowering businesses to thrive in the digital age. From custom Web Development 🌐 and intuitive App Development 📱 to transformative Data Analysis 📊 and Digital Marketing 📣, we’re here to elevate your digital presence.\n\nOur Key Services:\n\n🌐Web Development : Beautiful, user-focused websites crafted for impact.\n\n📱App Development : Building mobile apps from concept to deployment for iOS and Android.\n\n📊Data Analysis : Turning data into actionable insights to inform decisions.\n\n💼Business Development : Beyond projects, we help build sustainable businesses.\n\n☁️Cloud Computing : Unlock the potential of the cloud with expert migration and optimization.\n\n📊Big Data Solutions : Making sense of vast datasets with powerful tools.\n\n⏱️Real-Time Project Development : Responsive, real-time solutions for fast-paced environments.\n\n💰Finance Solutions : Custom fintech applications and financial tools.\n\n 💻Software Development: Tailored software for seamless operations and productivity.\n\n🎯Mission:\nTo earn the trust and loyalty of our clients by delivering exceptional results and fostering lasting relationships. With SS Infotech, people matter, and results count.\n\n🔎Vision:\nWe strive to harness and advance Information Technology, driving progress, connectivity, and a positive global impact. Through continuous innovation and creativity, we’re shaping a future where technology uplifts every facet of society.\n\n 💼From U.S.-based projects to global digital strategies, SS Infotech is dedicated to transforming challenges into opportunities, ensuring that your business stays ahead. Let’s innovate together  💼",
    "website": "https://www.ssinfotech.co/",
    "industry": "IT Services and IT Consulting",
    "company_size": "51-200 employees",
    "headquarters": "Nagpur, Maharashtra"
  },
  {
    "company_slug": "ditansource",
    "followers": "19K followers",
    "overview": "We aim to deliver a comprehensive solution through an innovative freelancing platform, ensuring exceptional quality at an optimal price.\n\nOur mission is to build a user-friendly platform that fosters global connections and empowers young talent. By enabling professionals to showcase and refine their skills in their chosen fields, we also provide clients with access to a diverse pool of talented individuals from around the world.communities to advance their careers.",
    "website": "https://ditansource.com/",
    "industry": "Technology, Information and Internet",
    "company_size": "11-50 employees",
    "headquarters": "Metuchen, New Jersey"
  },
  {
    "company_slug": "weareuplers",
    "followers": "1M followers",
    "overview": "Uplers is the #1 hiring platform for tech companies, designed to help you hire top product and engineering talent quickly and efficiently. Our end-to-end AI-powered platform combines artificial intelligence with human expertise to connect you with the best engineering talent from India.\n\nWith over 1M deeply vetted professionals, Uplers streamlines the hiring process, reducing lengthy screening times and ensuring you find the perfect fit. Companies like GitLab, Twilio, TripAdvisor, and Airbnb trust Uplers to scale their tech and digital teams effectively and cost-efficiently.\n\nExperience a simpler, faster, and more reliable hiring process with Uplers today.",
    "website": "https://www.uplers.com/",
    "industry": "Technology, Information and Internet",
    "company_size": "1,001-5,000 employees",
    "job_openings_text": "Uplers has 5,174 job openings - find the one for you."
  },
  {
    "company_slug": "ebizon",
    "followers": "119K followers",
    "overview": "Ebizon is the leading e-commerce and digital activation agency for brands and retailers globally. We have assisted over a dozen billion dollar companies with consulting, technology, operations, and digital marketing capabilities in managing their unique brand online.\n\nWe work with global online retailers, publishers, CSR groups, non-profits, and government institutions.\n\n* Headquartered in New Delhi, Ebizon's growing client list includes Intel, Tesco, DSM, Wieden+Kennedy, Future Group, DDB Mudra, Rediffusion Y&R, VSNL, Tata Motors, Jagran Prakashan Group, DSM and others. \n\n* We take pride in serving our Fortune 500 customers as well as product start-ups in the Education & Non-Profit verticals.\n\n* Ebizon is also the premier provider of Enterprise class Drupal Scaling Solutions.\n\nEbizon is founded by ex-IITians whose management & advisory team has the experience of working at Internet companies like Yahoo & TribalFusion.\n\nEbizon management / advisory have educational degrees from world-class institutions like IIT, Stanford and Haas, School of Business, Berkley.",
    "website": "https://www.ebizondigital.com/?utm_source=Linkedin&utm_medium=Linkedin%20Profile&utm_campaign=Linkedin&utm_content=Linkedin",
    "industry": "IT Services and IT Consulting",
    "company_size": "201-500 employees",
    "headquarters": "Noida, UP",
    "job_openings_text": "EbizON has 65 job openings - find the one for you."
  },
  {
    "company_slug": "mexico-live-jobs",
    "followers": "871 followers",
    "industry": "Technology, Information and Internet",
    "company_size": "11-50 employees"
  },
  {
    "company_slug": "zerodha",
    "followers": "552K followers",
    "overview": "Zerodha is an Indian financial services company (member of NSE, BSE, MCX) that offers brokerage-free equity investments, retail, institutional broking, currencies, and commodities trading. Founded in 2010, the company is headquartered in Bangalore and has a presence in nine Indian cities. It is also an official member of NSE's consultative committee for growing business.",
    "website": "http://www.zerodha.com",
    "industry": "Financial Services",
    "company_size": "501-1,000 employees",
    "headquarters": "Bangalore, Karnataka",
    "job_openings_text": "Zerodha has 1 job opening - find the one for you."
  },
  {
    "company_slug": "eminencesphere",
    "followers": "4K followers",
    "overview": "EminenceSphere was born from a bold vision — to create a collaborative space where talent meets technology and partnership fuels progress.\n\nFormerly known as Consulting Gurus, our journey began in direct hiring. As industry demands evolved, so did we. Today, we operate primarily as a B2B sub-vendor enabler, working at the intersection of clients and vendors to deliver custom IT consulting, staffing, and workforce solutions.\n\nWith over 70% of our operations driven by vendor collaboration and 30% in direct hiring, our model empowers us to scale rapidly, maintain quality, and build trust across regions — especially in India, the Middle East, and global IT hubs.\n\nAt Eminencesphere, we don’t just fill roles. We build bridges, empower vendors, and deliver results.",
    "industry": "IT Services and IT Consulting",
    "company_size": "51-200 employees",
    "headquarters": "New Delhi, Delhi"
  },
  {
    "company_slug": "bsquare-software-services",
    "followers": "1K followers",
    "overview": "Pioneering the Transformation of Enterprise Analytics\nElevate your analytics using a modern data infrastructure. Craft a results-driven strategy that provides your team with timely insights and meaningful KPIs.",
    "website": "https://bsquaress.com/",
    "industry": "Software Development",
    "company_size": "11-50 employees",
    "headquarters": "Greater Noida, Uttar Pradesh"
  },
  {
    "company_slug": "quantrail-data",
    "followers": "2K followers",
    "overview": "Quantrail Data offers a fully managed analytics platform designed for small and medium businesses (SMBs). Our solution simplifies data management and provides fast, cost-efficient, and scalable analytics across both public and private cloud environments. With features like built-in workflow automation, business intelligence (BI) tools, and high-performance storage, we empower businesses to make data-driven decisions with ease. Our platform streamlines the entire analytics process, enabling SMBs to focus on growth without the complexity of traditional data infrastructure.",
    "website": "https://quantrail-data.com/",
    "industry": "Software Development",
    "company_size": "2-10 employees",
    "headquarters": "Chennai, Tamil Nadu"
  },
  {
    "company_slug": "appzime",
    "followers": "106K followers",
    "overview": "🌐www.appzime.com || 📩business@appzime.com\n\nAt AppZime Technologies, we turn bold ideas into smart, reliable, and high-impact digital solutions.\nWe're a team of builders, problem-solvers, and curious minds who thrive on helping businesses grow with technology that actually makes a difference. Whether it’s crafting a custom application, automating a process, or scaling up with cloud-based systems, we bring speed, precision, and creativity to everything we do.\nIn a world that moves fast, we help our clients stay one step ahead. From startups to enterprises, we work as a true tech partner—bringing the right tools, talent, and thinking to solve real challenges and unlock new opportunities.\nBecause when tech is built around you and backed by us, great things happen.",
    "website": "https://appzime.com/",
    "industry": "Technology, Information and Internet",
    "company_size": "51-200 employees",
    "headquarters": "Navi Mumbai, Maharashtra",
    "job_openings_text": "AppZime Technologies has 2 job openings - find the one for you."
  },
  {
    "company_slug": "max-healthcare-office-of-research1",
    "followers": "2K followers",
    "overview": "Max Healthcare Office of Research is the dedicated research unit of Max Healthcare Institute Ltd. We are committed to advancing biomedical science and clinical application through translational biomedical studies, clinical trials, investigator-initiated studies, public health studies, genomics studies, RWE studies, and data research. \n\nThrough our infrastructure of the Clinical Trials Office, Regulatory Office, Biorepository, Molecular Genomics Lab, Grants and Collaborations Office, Biostatistics Office and Research Training Wing, we provide scientific, academic, and technical guidance and assistance to clinician scientists and dedicated research project teams across the Max Healthcare network.\n\nReach out to us to learn more about how we can help you.",
    "website": "https://www.maxhealthcare.in/research",
    "industry": "Research Services",
    "company_size": "11-50 employees",
    "headquarters": "Delhi, Delhi"
  },
  {
    "company_slug": "revic-ai",
    "followers": "1K followers",
    "overview": "Revic helps revenue teams win by focusing on the accounts that actually convert.\n\nOur AI agents continuously score every account based on what’s working in the field—real sales data, not static ICPs or outdated intent. The result: fewer dead ends, more winnable deals.\n\nAt the core is what we call collective sales memory—a system that captures every rep’s experience, every motion attempted, and every account outcome. Instead of tribal knowledge disappearing, Revic turns it into compounding intelligence that makes the whole team smarter.\n\nSo reps stay focused. Pipeline stays healthy. And GTM strategy reflects how your market is moving right now.\n\nBuilt for CROs, CMOs, and RevOps leaders who want to fix the root cause of pipeline problems—so sales can do what it does best: close.",
    "website": "https://revic.ai/",
    "industry": "Software Development",
    "company_size": "11-50 employees",
    "headquarters": "San Francisco, California",
    "job_openings_text": "Revic has 5 job openings - find the one for you."
  },
  {
    "company_slug": "alliedge-technologyptld",
    "followers": "2K followers",
    "overview": "Welcome to Alliedge Technology!\nFired up by our passion for tech, we're a squad of young innovators eager to revolutionize your business. With our focus on the future, we're ready to introduce you to innovative ideas and solutions, guiding you toward success in the digital world.\n\nHere's what we're delighted to offer you:\nWeb Development\nApp Development\nSoftware Development\nE-Commerce Development\nCloud Computing\nArtificial Intelligence\n\nBut that's just the beginning. \nWe're here to be more than just your service provider; we're your partners in progress. Our customer-centric approach means we're dedicated to understanding your unique needs and delivering solutions that not only meet but exceed your expectations. \n\nAt Alliedge Technology, we're not just about technology – we're about transforming your business for the better.\n\nSo, if you're ready to take your business to the next level, why not join forces with Alliedge Technology? We can't wait to embark on this exciting journey with you!",
    "website": "https://alliedge.in/",
    "industry": "IT Services and IT Consulting",
    "company_size": "11-50 employees"
  },
  {
    "company_slug": "infosys-bpm",
    "followers": "2M followers",
    "overview": "Infosys BPM Ltd., the business process management subsidiary of Infosys Ltd. (NYSE: INFY), was set up in April 2002. Infosys BPM focuses on integrated end-to-end outsourcing and delivers transformational benefits to its clients through reduced costs, ongoing productivity improvements, and process re-engineering. Infosys BPM operates in India, Poland, the Czech Republic, the Netherlands, Ireland, South Africa, Brazil, Mexico, Costa Rica, the United States, Puerto Rico, China, the Philippines, Singapore, and Australia.\n\nInfosys BPM has been consistently ranked among the leading BPM companies and has received over 60 awards and recognitions in the last 5 years from key industry bodies and forums like the International Association of Outsourcing Professionals, Outsourcing Center, SSON, and NOA, among others. Infosys BPM also has very robust people practices, as substantiated by the various HR-specific awards it has won over the years. The company has consistently been ranked among the top employers of choice, on the basis of its industry-leading HR best practices. The company’s senior leaders contribute widely to industry forums as BPO strategists.",
    "website": "https://www.infosysbpm.com",
    "industry": "IT Services and IT Consulting",
    "company_size": "10,001+ employees",
    "headquarters": "Bengaluru, Karnataka",
    "job_openings_text": "Infosys BPM has 307 job openings - find the one for you."
  },
  {
    "company_slug": "bitlance-technologies",
    "followers": "2K followers",
    "website": "www.bitlance.com",
    "industry": "Software Development",
    "company_size": "201-500 employees"
  },
  {
    "company_slug": "appinventiv",
    "followers": "637K followers",
    "overview": "Appinventiv is redefining how businesses innovate by building AI-powered digital products & solutions that drive growth, efficiency, and exceptional user experiences. As a leading global product development and digital transformation agency, we empower disruptive startups, Fortune 500 companies & global enterprises to bridge the gap between ideas and reality using cutting edge technologies like Artificial Intelligence, Blockchain, Cloud, and Data Analytics.\n\nWith a passionate team of 1600+ innovators spread across 6 global centers of excellence, we have launched 3000+ digital products that have transformed industries and touched millions of lives. Our relentless pursuit of innovation and excellence positions us among the fastest-growing technology companies worldwide.\n\nRecognized by the Best :\n\n-Fastest Growing Company 2025 by Clutch\n-Deloitte Technology Fast 50 (2023–2024)\n-Preferred Partner 2024 by CIO Association\n-Tech Company of the Year by Times Business Award\n-India’s Growth Champion in IT 2023 | The Economic Times\n\nWhat Sets Us Apart :\n\n3000+ Digital Products Delivered\n1600+ Talented Minds\nISO-Certified, Ranked #1 on multiple B2B portals\nAI-first approach for business transformation\nCulture of innovation and speed-to-market execution\n\nOur Expertise :\n\nArtificial Intelligence & Data Science\nAI-powered Business Solutions\nMachine Learning Models\nPredictive Analytics & NLP\nDigital Transformation & Product Engineering\nConsulting & Product Strategy\nCustomer Experience Design\nCustom Application Development\nMobility Solutions\nNative & Hybrid Apps\nWearables & PWA Development\nCloud & DevOps\nCloud-native Applications\nDevOps as a Service\nBlockchain Development\nDApps & Smart Contracts\nNFT & DeFi Solutions\n\nAt Appinventiv, AI is not the future-it’s now. Integrating next-gen technologies into every product to unlock scalability, intelligence,& automation. Our mission remains clear to deliver meaningful digital experiences that shape the future of businesses globally.",
    "website": "https://appinventiv.com/",
    "industry": "IT Services and IT Consulting",
    "company_size": "1,001-5,000 employees",
    "headquarters": "Noida, Uttar Pradesh",
    "job_openings_text": "Appinventiv has 6 job openings - find the one for you."
  },
  {
    "company_slug": "fluxatic",
    "followers": "2K followers",
    "overview": "We here at Fluxatic Global are on a mission to elevate businesses all over the world.\n Our boutique, meticulously tailored, and state-of-the-art Website / WebApp Development, AI, UI/UX Services, and Branding Solutions services are crafted to drive your revenue growth, elevate your brand in this vast digital universe and optimise your operational efficiency.\n\nEvery idea, pixel & line of code is meticulously tailored to create long-term impact on you and the world, and it shows in our achievements:\n\n240+ Projects Executed, INR 21 Crore+ Revenue Facilitated, Solutions deployed in 14+ Countries & we aren’t slowing down anytime soon!\n\nIn the fast-paced & immersive digital world of today, we are your strategic partner, committed to helping your business reach its full potential and achieve remarkable success.",
    "website": "https://fluxatic.com",
    "industry": "IT Services and IT Consulting",
    "company_size": "11-50 employees",
    "headquarters": "Bardez, Goa"
  },
  {
    "company_slug": "yes-bank",
    "followers": "1M followers",
    "overview": "YES BANK is a leading Indian private sector bank committed to transforming the financial landscape of India. With over 1200 branches nationwide and a dedicated team of YES BANKers, we strive to deliver exceptional banking solutions and empower individuals, businesses and communities to thrive. \nAt YES BANK, we believe in the power of innovation and transparency. Operating in Retail, MSME and Corporate banking sectors, we are a full service bank and offer an extensive range of financial services. We leverage cutting-edge technology & industry insights to meet the evolving needs of our diverse clientele. One in three UPI transactions in the country are processed by YES BANK.\nDriven by our core values, we aim to build long lasting relationships with our customers and stakeholders. Our robust risk management framework ensures the safety and security of your finances, while our unwavering commitment to sustainability drives us to create a positive impact on society and the environment. \nWe recognize the potential within each person and strive to unlock it through opportunities for growth, learning and innovation. Joining our ranks means joining a vibrant ecosystem of individuals who are passionate about making an impact and shaping the future of banking. \nTogether, let’s create a future where your dreams can flourish and make a lasting impact.\n\nNote: \nYES BANK will NEVER ask you to reveal your User ID or Password. Therefore, never disclose your credentials (User ID, Password, OTP, PIN etc.) to anyone either through mail or over phone. If you receive any mail asking you to update or authenticate your User ID or Password, please DO NOT fall into the trap of putting in your Password or OTP or PIN.",
    "website": "http://www.yesbank.in",
    "industry": "Banking",
    "company_size": "10,001+ employees",
    "headquarters": "Mumbai, Maharashtra",
    "job_openings_text": "YES BANK has 135 job openings - find the one for you."
  },
  {
    "company_slug": "skyraan-technologies",
    "followers": "2K followers",
    "overview": "Skyraan Technologies is the hub for several IT services, such as web design and development, mobile app development, digital marketing, and branding services. If you need any other IT products or services, don't hesitate to contact us!",
    "website": "https://www.skyraan.com/",
    "industry": "Software Development",
    "company_size": "11-50 employees",
    "headquarters": "Coimbatore, Tamil Nadu"
  },
  {
    "company_slug": "vortexsoft-innovations-private-limited",
    "followers": "944 followers",
    "overview": "We provide innovative and reliable IT solutions tailored to meet your business needs — from custom software and consulting to digital marketing, manpower supply, and AI-based training.",
    "website": "https://vortexsoftinnovations.in/",
    "industry": "IT Services and IT Consulting",
    "company_size": "51-200 employees",
    "headquarters": "Bangalore, karnataka"
  },
  {
    "company_slug": "national-bank-of-egypt",
    "followers": "810K followers",
    "overview": "Since its inception in 1898 with a capital of GBP1 million, NBE has been regarded as one of the oldest and most respected commercial banks in Egypt.Never isolated from national issues or concerns, NBE has been the primary supporter of Egypt’s national economy by financing the major Egyptian national projects.\nNBE’s missions and operations have continuously evolved throughout history and the economic and political changes experienced by the country.NBE was entrusted with issuing banknotes and handling government accounts, then in the 1950’s its activities evolved to undertaking the duties of the Central Bank. In the 1960’s it focused on commercial banking while still handling the central banking duties in locations where the Central Bank had no branches. Eventually, issuing and managing Investment Certificates for the State.NBE currently controls 23.6% of the market share of total assets in the Egyptian banking sector, 25.8% of total deposits, and 21.8% of total loans.\nNBE owns a large network includes over 337 branches, offices and banking units across the country, alongside an international presence through NBE (United Kingdom), NBE (Republic of the Sudan) and NBE’s branches in New York (United States of America) and Shanghai (People’s Republic of China), as well as representative offices in Johannesburg (South Africa), Dubai (United Arab Emirates), and Adis Ababa (Republic of Ethiopia), in addition to a branch in the Dubai International Finance Center.NBE also has a network of correspondents throughout the world, but centered in Europe— Egypt’s primary trade partner.NBE is always keen on an effective presence in brokerage, financing different sectors, and maintaining the client’s trust by offing the best and latest services.Whilst leading the local banking market,NBE is continuously upgrading its network of branches and channels of electronic communication, and strives to refine its human resources through advanced national and international training programs.",
    "website": "http://www.nbe.com.eg",
    "industry": "Banking",
    "company_size": "10,001+ employees",
    "headquarters": "Boulak, Cairo"
  },
  {
    "company_slug": "computer-information-systems",
    "followers": "16K followers",
    "overview": "With 5000 resellers and 2000 enterprises in 30 countries, CIS Group is a leading technology solutions provider operating in Africa, the Middle East and Europe. \nThe group’s complete turnkey solutions integrate hardware, software, as well as intelligent Cloud solutions, and its offerings encompass the design, installation and after-sales services of complex systems with multi-vendor configurations and project management. \nLeveraging partnerships with leading global ICT vendors, we meet the needs of diverse sectors, including Finance, Telco, Government, Health & Education, and Extended Manufacturing, in Computing, Software, Networking and Cloud. This combined with the in-depth expertise of our experienced professionals, our local sales and support presence, and our comprehensive service offering makes CIS Group a compelling choice for ICT needs.",
    "website": "http://www.groupcis.com",
    "industry": "Information Technology & Services",
    "company_size": "1,001-5,000 employees",
    "headquarters": "Jal El Dib, Metn",
    "job_openings_text": "Computer Information Systems (CIS Group) has 1 job opening - find the one for you."
  },
  {
    "company_slug": "sugar-cosmetics",
    "followers": "378K followers",
    "overview": "SUGAR Cosmetics is a cruelty-free makeup brand that is high on style and higher on performance. The brand is inspired by and targeted towards bold, independent women who refuse to be stereotyped into roles.\n\nManufactured in state-of-the-art facilities across Germany, Italy, India, USA and Korea the brand ships its bestselling products across Lips, Eyes, Face and Nail categories across the world.",
    "website": "http://www.sugarcosmetics.com",
    "industry": "Personal Care Product Manufacturing",
    "company_size": "201-500 employees",
    "headquarters": "Mumbai, Maharashtra",
    "job_openings_text": "SUGAR Cosmetics has 7 job openings - find the one for you."
  },
  {
    "company_slug": "mama-earth-in",
    "followers": "180K followers",
    "overview": "We are parents just like you. Our journey began when we, Ghazal and Varun, were expecting our first child. That’s the time we turned from a bungee jumping, pub hopping, carefree couple to basically a couple of safety wardens. Everything had to be safe, kosher & googled. When the morning sickness became a routine, we were shocked to find that there were no safer alternatives to pills and ended up having to struggle a lot.\n\nAfter 9 rigorous months, we were finally blessed with our tiny little bundle of joy and just like you and every other parent in the world; we too wanted the best for our cute bambino. So we wore our spyglasses & did all the possible research available. Whoa, we were shocked to see how most baby products, be it lotion or shampoo contained toxins which have proven to be harmful to the little ones. We were worried sick and it wasn’t just our baby we were worried about but also for all the little ones we knew in our friend circle. That’s when we decided to do something about it & create products which were completely safe & certified toxin free. A brand, by a parent, for the parent. A brand which develops products from world-class research and attempts to solve every little problem that we as parents face. With the aim of making products which are mum-baby friendly, toxin-free, meet stringent international standards & are basically ultra-awesome, Mamaearth was born.",
    "website": "https://mamaearth.in",
    "industry": "Health, Wellness & Fitness",
    "company_size": "51-200 employees",
    "headquarters": "Gurgaon, Haryana",
    "job_openings_text": "Mamaearth has 1 job opening - find the one for you."
  },
  {
    "company_slug": "plum-goodness",
    "followers": "84K followers",
    "overview": "Plum is one of India’s science-first, vegan, premium beauty brand with a strong portfolio of skincare and haircare products. By smartly combining research-backed actives with the chemistry of botanical ingredients, Plum creates formulas that truly resonate. At the heart of everything, Plum has a simple message: 'We have chemistry - with each other, with our product & especially with our customer.’\n\nThe brand is driven by a strong leadership and investor team, focused on building value for people, the planet, and profit-sharing participants.",
    "website": "https://plumgoodness.com/",
    "industry": "Personal Care Product Manufacturing",
    "company_size": "201-500 employees",
    "headquarters": "Mumbai, Maharashtra",
    "job_openings_text": "Plum has 4 job openings - find the one for you."
  },
  {
    "company_slug": "mcaffeine",
    "followers": "205K followers",
    "overview": "We are a personal care brand, on a mission to add a caffeine rush to your lifestyle, getting you #UpForLife.\n\nCo-founded by Tarun Sharma, Vikas Lachhwani, Vaishali Gupta, Mohit Jain, and Saurabh Singhal, our brand focuses on bringing the super ingredient Caffeine to everyday life of Millennials and Gen Zs in three forms: Energizing Coffee, Refreshing Tea and Indulging Chocolate.\n\nOur portfolio comprises more than 95 caffeine-based products in multiple categories, with the major ones being Body Care, Face Care, Hair Care, Eye Care and Lip Care. We have plans to continuously add new launches to our portfolio.\n\nWe're addicted to the rush of energy, the surge of antioxidants, and the irresistible aroma that leaves you craving for more. But that's not all. We are the winners of the Nykaa Femina Beauty Awards 2022 for Best Choco Body Butter and Grazia India's Most Loved Brands 2021.\n\nOur products are SLS and Parabens Free, FDA approved, Made Safe certified, have a zero plastic footprint, and are PETA certified. They are 100% Vegan & Cruelty-Free.\n\n\nVisit us at www.mcaffeine.com",
    "website": "http://bit.ly/mcaffeine",
    "industry": "Personal Care Product Manufacturing",
    "company_size": "501-1,000 employees",
    "headquarters": "Mumbai, Maharashtra 400072, Maharashtra",
    "job_openings_text": "mCaffeine has 2 job openings - find the one for you."
  },
  {
    "company_slug": "dot-key-skincare",
    "followers": "93K followers",
    "overview": "Dot & Key is an award-winning skincare company established to transform the idea of 'skincare' into a fun, easy, and acceptable notion.\n\nA fresh take on skincare. One that's founded on the understanding that everyone is unique. Through our range of advanced skincare products, we address lifestyle needs that are often overlooked.\n\nTHE BEST OF\nNATURE & SCIENCE\n\nThe amount of thought and care we put in at every step is reflected in the results. We start by sourcing the best natural ingredients from across the globe. Then, we process them using cutting-edge science to create unique formulations that deliver on their promise. Think of a wide array of effective remedies that are as gentle as nature itself.\nFULL OF LOVE\nFREE OF TOXINS\n\nGlance at our list of ingredients, and you won't find any toxic chemicals like parabens, sulfates, and phthalates. Everything we make is clinically tested and cruelty-free, so you can use it without worry in the world. This is the Dot & Key promise: superior skincare that's absolutely safe, delightfully gentle, and unquestionably effective.",
    "website": "https://www.dotandkey.com/",
    "industry": "Cosmetics",
    "company_size": "51-200 employees",
    "headquarters": "Kolkata, West Bengal",
    "job_openings_text": "Dot & Key Skincare has 6 job openings - find the one for you."
  },
  {
    "company_slug": "beminimalist",
    "followers": "77K followers",
    "overview": "Founded in 2020 with the belief that the beauty industry requires a revolution with respect to TRANSPARENCY. At Minimalist, we create hard-working, clean, easy to understand, and affordable skincare for all.\n\nLet's Talk Science.",
    "website": "https://beminimalist.co",
    "industry": "Cosmetics",
    "company_size": "51-200 employees",
    "headquarters": "Jaipur, Rajasthan",
    "job_openings_text": "Minimalist has 1 job opening - find the one for you."
  },
  {
    "company_slug": "financial-services-development-council",
    "followers": "23K followers",
    "overview": "Mission\nThe FSDC was established in 2013 by the Hong Kong Special Administrative Region Government as a high-level, cross-sectoral advisory body to engage the industry in formulating proposals to promote the further development of the financial services industry of Hong Kong and to map out the strategic direction for the development.\n \nThe FSDC has been incorporated as a company limited by guarantee with effect from September 2018 to allow it to better discharge its functions through research, market promotion and human capital development with more flexibility.\n \nObjectives\nThe FSDC aims to:\n- advise the Government on strategies and measures to expand the scope of the financial markets of Hong Kong and enhance the competitiveness of Hong Kong as an international financial centre;\n- support the financial services industry of Hong Kong in developing the core competence and knowledge of its practitioners; and\n- promote the financial services industry of Hong Kong and Hong Kong as an international financial centre in the Mainland and overseas.\n\nTerms of Reference\nThe terms of reference of the FSDC are to:\n- conduct policy research and industry surveys for the formulation of proposals to the Government and regulators;\n- work with regulatory and trade bodies to identify new opportunities for, and any constraints on, the sustainable growth and diversity of the financial services industry;\n- maintain a dialogue with the relevant bodies in the Mainland and overseas to support the financial services industry of Hong Kong in accessing new markets and growth areas;\n- facilitate the upgrading of skills and expertise through collaboration with education and training institutions, trade bodies and practitioners; and\n- promote, in the Mainland and overseas, the financial services industry of Hong Kong and Hong Kong as an international financial centre through seminars, road shows, publications, and through active participation in international events.",
    "website": "https://www.fsdc.org.hk/en/hkawl/what-s-hkawl/",
    "industry": "Financial Services",
    "company_size": "11-50 employees",
    "headquarters": "Hong Kong , Hong Kong"
  },
  {
    "company_slug": "hong-kong-monetary-authority",
    "followers": "99K followers",
    "overview": "The Hong Kong Monetary Authority (HKMA) was established on 1 April 1993 by merging the Office of the Exchange Fund with the Office of the Commissioner of Banking. Its main functions and responsibilities are governed by the Exchange Fund Ordinance and the Banking Ordinance and it reports to the Financial Secretary.\n\nThe HKMA is the government authority in Hong Kong responsible for maintaining monetary and banking stability. Its main functions are:\n\n- maintaining currency stability within the framework of the Linked Exchange Rate System\n\n- promoting the stability and integrity of the financial system, including the banking system\n\n- helping to maintain Hong Kong's status as an international financial centre, including the maintenance and development of Hong Kong's financial infrastructure\n\n- managing the Exchange Fund.",
    "website": "http://www.hkma.gov.hk",
    "industry": "Banking",
    "company_size": "501-1,000 employees",
    "job_openings_text": "Hong Kong Monetary Authority (HKMA) has 4 job openings - find the one for you."
  },
  {
    "company_slug": "discover",
    "followers": "228K followers",
    "overview": "Discover® is now part of Capital One. Together, we’ll continue to deliver exceptional financial products and experiences, drive innovation, and serve customers. Find the latest updates at https://capitalonediscover.com.\n\nDiscover is one of the most recognized brands in the U.S. with the Discover® card, America's cash rewards pioneer, and offers personal loans, home loans, checking and savings accounts and certificates of deposit. The Discover Global Network® is comprised of Discover Network, with millions of merchants and cash access locations; PULSE®, one of the nation's leading ATM/debit networks; and Diners Club International®, a global payments network with acceptance around the world.",
    "website": "http://www.discover.com",
    "industry": "Financial Services",
    "company_size": "10,001+ employees",
    "headquarters": "Riverwoods, IL",
    "job_openings_text": "Discover has 124 job openings - find the one for you."
  },
  {
    "company_slug": "computer-management-&-marketing-associates-inc-",
    "followers": "452 followers",
    "overview": "Providing Information Technology services and solutions to the Lehigh Valley for over 35 years!  Backed by acknowledged leaders in the IT industry, CMA provides an extensive selection of hardware and software solutions. As a premier Dell Partner and IBM Business Partner, we sell, install and service a multitude of network servers, desktops, notebooks, printers, and communication and networking equipment.\n\nCMA is providing ERP Application Software to businesses.   The  Distribution software is known as Application Plus, or A+.   We also develop custom application software to better meet the needs of our customers.  This includes Web development or Distribution, Manufacturing and Non-Profit programming support.",
    "website": "http://www.cmma.com",
    "industry": "IT Services and IT Consulting",
    "company_size": "11-50 employees",
    "headquarters": "Bethlehem, Pennsylvania"
  },
  {
    "company_slug": "the-computer-healer-llc",
    "followers": "40 followers",
    "overview": "The Computer Healer Online provides zero-hassle, predictable-cost information technology and computer services support for small-to-midsized companies in Michigan . With dedicated IT engineers, proven processes and a 100% no-hassle guarantee, The Computer Healer simplifies information technology management for healthcare, nonprofit, professional services and manufacturing clients.",
    "website": "https://www.thecomputerhealer.com/",
    "industry": "IT Services and IT Consulting",
    "company_size": "0-1 employees",
    "headquarters": "okemos, Michigan"
  },
  {
    "company_slug": "dirt-work-solutions-llc",
    "followers": "9 followers",
    "overview": "DIRT WORK SOLUTIONS LLC is a company based out of 3755 MAIN ST, Slatington, Pennsylvania, United States.",
    "website": "https://editor.wix.com/html/editor/web/renderer/edit/a0bc2cd5-8ed5-4a35-a3eb-33300cf288b6?metaSiteId=ddef9868-f95c-4763-8a7e-48c67c2f534d",
    "industry": "Construction",
    "company_size": "51-200 employees",
    "headquarters": "Slatington, Pennsylvania"
  },
  {
    "company_slug": "it-services-and-it-consulting",
    "followers": "2K followers",
    "website": "http://www.standalonehub.com/",
    "industry": "IT Services and IT Consulting",
    "company_size": "11-50 employees"
  },
  {
    "company_slug": "it-solutions-consulting-llc",
    "followers": "30K followers",
    "overview": "With 30 years of experience as a trusted managed services provider, we're your dedicated partner in navigating the complex world of technology, so you can focus on growing your business. Our customer-centric approach ensures your success, providing tailored support services that empower your business to thrive. From strategic guidance to comprehensive managed IT support, cybersecurity to cloud services, we're here to propel your growth while delivering innovative solutions that make a lasting impact.\n\nTechnology changes constantly, but our commitment to you never does.",
    "website": "https://www.itsolutions-inc.com",
    "industry": "IT Services and IT Consulting",
    "company_size": "501-1,000 employees",
    "headquarters": "Fort Washington, PA",
    "job_openings_text": "IT Solutions has 31 job openings - find the one for you."
  },
  {
    "company_slug": "it-verticals-inc",
    "followers": "21K followers",
    "overview": "ITVerticals Inc. is a high-tech service provider that specializes in Software Development and Outsourcing solutions. Our team of highly experienced and seasoned managers work closely with you to provide a solution that is tailored to your business needs.\n\nHere are a few of the many services we provide to our clients: \n\n- Digital Marketing\n   Search Engine Optimization\n   Search Engine and Internet Marketing \n   Social Media Marketing \n   Blog and Content development \n- Custom Software Application Development \n- Web Development & eCommerce Solutions \n- Outsourcing Solutions \n- IT Management and Technology Consulting \n- Creative Services",
    "website": "http://www.itverticals.com",
    "industry": "IT Services and IT Consulting",
    "company_size": "51-200 employees",
    "headquarters": "Tampa, Florida"
  },
  {
    "company_slug": "newlineinfocorp",
    "followers": "42K followers",
    "overview": "Newlineinfo Corp  is a reputable consulting firm that operates across the nation, committed to delivering exceptional resources to cater to our clients' diverse hiring needs in technology, assessment, management, logistics, and accounting/finance.\n\nWe specialize in offering comprehensive solutions to address various corporate challenges such as organizational transformations, headcount limitations, budgetary constraints, fundamental shifts in core business operations, staff augmentation requirements, and mergers/acquisitions.\n\nOur primary objective is to provide top-notch consultants who excel at completing your projects within the designated timelines and budgetary limits. With our experienced sales and recruitment team, we make it a priority to thoroughly comprehend your business direction, technical prerequisites, and unique organizational culture. This deep understanding allows us to allocate the best available resources to fulfill your organization's staff augmentation needs effectively.\n\nExplore the most up-to-date Newlineinfo Corp opportunities by visiting our career site at https://newlineinfo.com/career/. Stay informed about the latest job openings and take the next step towards an exciting career with Newline.",
    "website": "https://www.newlineinfo.com",
    "industry": "IT Services and IT Consulting",
    "company_size": "201-500 employees",
    "headquarters": "Frisco, Texas",
    "job_openings_text": "Newlineinfo Corp - IT Services and IT Consulting has 1 job opening - find the one for you."
  },
  {
    "company_slug": "nextrio",
    "followers": "493 followers",
    "overview": "What can we do for your business?\n\nWhether you need an outsourced IT department, a SWAT team for IT projects that require specific skills or a Virtual CIO to provide a roadmap and/or oversight, Nextrio is the most cost-effective way to manage the large and small technology tasks that keep business owners working on their business - not in it.",
    "website": "http://www.nextrio.com",
    "industry": "IT Services and IT Consulting",
    "company_size": "11-50 employees",
    "headquarters": "Tucson, AZ"
  },
  {
    "company_slug": "steady-networks",
    "followers": "682 followers",
    "overview": "Albuquerque's Largest IT Company Specializing in Medical and Legal Practice IT Management \n\n\n\nSteady Networks is your partner in both reliable Computer Support and the long-term success of your business. We deliver custom designed Network Services that better map to your business, so you can stop worrying about your technology and get back to achieving your business goals.\n\nOur experienced professionals are your partners in IT Consulting, so your business can simplify its everyday processes and increase efficiency in Albuquerque, Santa Fe and Espanola.\n\nWith Steady Networks as your dependable partner in IT, you can:\n\nEnjoy high levels of productivity – keep your business running without any downtime\nConcentrate on your business goals – with technology worries in our hands\nOptimize your ROI – strategic technology pays for itself faster\nKeep your technology assets secure – our systems keep your network protected\nBecome worry-free – with secure technology that exceeds your expectations",
    "website": "http://www.steadynetworks.com",
    "industry": "IT Services and IT Consulting",
    "company_size": "11-50 employees",
    "headquarters": "Albuquerque, NM"
  },
  {
    "company_slug": "its-for-legal",
    "followers": "113 followers",
    "overview": "For 30+ years, we’ve helped law firms stay secure, productive, and ready for what’s next. As a Top-5 provider of IT services for law firms, our solutions span cybersecurity, cloud, compliance, and advisory—tailored to the pace and requirements of legal practice.\n\nClick Follow for expert insights and legal IT solutions that protect your data, empower your team, and support the way your firm works.",
    "website": "https://www.itsolutions-inc.com/industries/legal-services/",
    "industry": "IT Services and IT Consulting",
    "company_size": "501-1,000 employees"
  },
  {
    "company_slug": "it-&-ebusiness-consulting-services-inc-",
    "followers": "15K followers",
    "overview": "ITECS offers a selective array of IT services designed to help businesses accomplish key initiatives quickly and cost effectively.  By providing both staff augmentation and project-based professional services, ITECS is able to bring the right delivery solution to meet clients' ever changing technology needs.  In addition, clients have the flexibility of leveraging on-shore, near shore and off-shore Solution Centers as well as benefit from ITECS; industry-experienced, localized account management that helps to ensure delivery satisfaction.",
    "website": "http://WWW.ITECSUS.COM",
    "industry": "IT Services and IT Consulting",
    "company_size": "51-200 employees",
    "headquarters": "Melville, New York"
  },
  {
    "company_slug": "ameriprise-financial-services-llc",
    "followers": "198K followers",
    "overview": "At Ameriprise Financial, we have been helping people feel more confident about their financial future for 130 years. With extensive investment advice, asset management and insurance capabilities and a nationwide network of approximately 10,000 financial advisors*, we have the strength and expertise to serve the full range of individual and institutional investors' financial needs. \n\nAmeriprise has corporate locations throughout the U.S. and across the globe, and advisor offices in all 50 states. \n\nCertain hyperlinks within Ameriprise Financial web sites or social media content may hyperlink to third-party content which we believe to be reliable however, we cannot guarantee its accuracy or completeness. For this reason, we do not endorse any linked third-party content, advertising, advice, opinions, recommendations, or other information; it's merely intended to be provided as a general source of information and is not a solicitation to buy or sell any securities, accounts, or strategies. In addition, any linked third-party content should not be used as the sole basis for any investment decisions, nor should it be construed as a recommendation or advice designed to meet the particular needs of an individual investor. Please seek the advice of a financial advisor regarding your particular financial situation.  \n\nInvestment products are not insured by the FDIC, NCUA or any federal agency, are not deposits or obligations of, or guaranteed by any financial institution, and involve investment risks including possible loss of principal and fluctuation in value.\n\nInvestment advisory products and services are made available through Ameriprise Financial Services, LLC, a registered investment adviser.   \n\nSecurities offered by Ameriprise Financial Services, LLC. Member FINRA and SIPC.\n\nFor additional important disclosures on engagement rules, linking to third party content or other risks, please visit: www.ameriprise.com/social \n\n*Ameriprise Financial Q1 2024 Earnings Release.",
    "website": "http://www.ameriprise.com/?cid=LinkedInHome",
    "industry": "Financial Services",
    "company_size": "5,001-10,000 employees",
    "headquarters": "Minneapolis, MN",
    "job_openings_text": "Ameriprise Financial Services, LLC has 184 job openings - find the one for you."
  },
  {
    "company_slug": "banking-online",
    "followers": "29K followers",
    "overview": "We are the best seller of the biggest online selling platform of the world; Amazon.com.  We will post products, details and order link to give our customers easy way to get the best of Amazon.com.\nDeals & Specials are posted based on product category. Please See Affiliate Pages",
    "website": "https://www.amazon.com/b?_encoding=UTF8&tag=deal4u005-20&linkCode=ur2&linkId=985d26c89872716ad20c8364df733bb3&camp=1789&creative=9325&node=16310091",
    "industry": "Banking",
    "company_size": "51-200 employees",
    "headquarters": "Mount Vernon, New York"
  },
  {
    "company_slug": "the-banking-recruiters",
    "followers": "188K followers",
    "overview": "The Banking Recruiters is one of the most remarkable organizations in the field of Banking Recruitments. Through the creative use of cutting edge technology and a series of ground breaking business ideas TBR has taken over from general recruitment services consultancy to a trusted and adopted brand in Banking Recruitments.\nBased on scrupulous research and extraordinary connections and networking, backed by a professional team of Ex- Bankers, HRs, Recruitment Specialists, Techies and financial super minds TBR has achieved the trust and recognition in a short span of time.",
    "website": "http://www.thebankingrecruiters.com",
    "industry": "Staffing and Recruiting",
    "company_size": "11-50 employees",
    "headquarters": "Mumbai, Maharashtra"
  },
  {
    "company_slug": "bankingcircle",
    "followers": "36K followers",
    "overview": "Banking Circle S.A. is a public limited liability company (Société Anonyme) and a credit institution (e.g., a bank) headquartered in Luxembourg and regulated by the Commission de Surveillance du Secteur Financier (CSSF) as its home regulator. Banking Circle S.A. has branches in Denmark, Norway, Sweden, Germany, and the UK, and subsidiaries in Liechtenstein, Singapore, and Australia.\n \nAs a fully licensed bank, Banking Circle S.A. combines pioneering technology and the established central bank clearing system to provide ultra high-speed access to global, multi-currency instant payment schemes. Banking Circle S.A. enables payments companies and banks of any scale to seize opportunities in the new economy—quickly, at low cost. Through bespoke, flexible, scalable, and future-proof solutions, Banking Circle S.A. is enabling financial institutions to help their customers transact across borders in innovative ways.",
    "website": "https://www.bankingcircle.com",
    "industry": "Financial Services",
    "company_size": "501-1,000 employees",
    "job_openings_text": "Banking Circle has 19 job openings - find the one for you."
  },
  {
    "company_slug": "icici-bank",
    "followers": "4M followers",
    "overview": "ICICI Bank is one of India’s leading private sector banks, offering a wide range of banking products and services to corporate, Small and Medium Enterprises (SME) and individual customers across the country. The Bank offers multi-channel touch points including branches, ATMs, mobile banking, internet banking, and phone banking.\n\nThe Bank has a network of 6,742 branches and 16,277 ATMs and cash recycling machines across India, as at December 31, 2024.\n\nFor any assistance on products and services, please call ICICI Bank’s customer care number 1800 1080.\n\nDisclaimer: The content herein is only for information and does not amount to an offer, invitation or solicitation to buy or sell, and is not intended to create any rights or obligations. It is also not intended for distribution to, or use by, any person in any jurisdiction where such distribution or use would be contrary to law or would subject ICICI Bank Limited (“ICICI Bank”) or its affiliate(s) to any licensing or registration requirements. Nothing contained herein is intended to constitute advice or opinion; please obtain professional advice before relying on any information contained herein. ICICI Bank disclaims any liability with respect to accuracy of information or any error or omission or any loss or damage incurred by anyone in reliance on the contents herein.",
    "website": "https://www.icicibank.com",
    "industry": "Banking",
    "company_size": "10,001+ employees",
    "headquarters": "Mumbai , Maharashtra",
    "job_openings_text": "ICICI Bank has 14 job openings - find the one for you."
  }
]